/*
#############################################################################################
# RocketLeague (1.0.10897.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: ProjectX_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct ProjectX._SharedHelpers.Orientation
// 0x0018
struct FOrientation
{
	struct FVector                                     Location;                                         		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FRotator                                    Rotation;                                         		// 0x000C (0x000C) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.ClubColorSet
// 0x0008
struct FClubColorSet
{
	unsigned char                                      TeamColorID;                                      		// 0x0000 (0x0001) [0x0000000000000000]              
	unsigned char                                      CustomColorID;                                    		// 0x0001 (0x0001) [0x0000000000000000]              
	unsigned long                                      bTeamColorSet : 1;                                		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bCustomColorSet : 1;                              		// 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct ProjectX._Types_X.CustomMatchTeamSettings
// 0x0014
struct FCustomMatchTeamSettings
{
	struct FString                                     Name;                                             		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FClubColorSet                               Colors;                                           		// 0x000C (0x0008) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.CustomMatchSettings
// 0x0060
struct FCustomMatchSettings
{
	struct FString                                     GameTags;                                         		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FName                                       MapName;                                          		// 0x000C (0x0008) [0x0000000000000000]              
	unsigned char                                      GameMode;                                         		// 0x0014 (0x0001) [0x0000000000000000]              
	int                                                MaxPlayerCount;                                   		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FString                                     ServerName;                                       		// 0x001C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Password;                                         		// 0x0028 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bPublic : 1;                                      		// 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FCustomMatchTeamSettings                    TeamSettings[ 0x2 ];                              		// 0x0038 (0x0028) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.JoinMatchSettings
// 0x0018
struct FJoinMatchSettings
{
	unsigned char                                      MatchType;                                        		// 0x0000 (0x0001) [0x0000000000000000]              
	int                                                PlaylistId;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned long                                      bFriendJoin : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bMigration : 1;                                   		// 0x0008 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bRankedReconnect : 1;                             		// 0x0008 (0x0004) [0x0000000000000000] [0x00000004] 
	struct FString                                     Password;                                         		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.SkillMatchPlayer
// 0x0054
struct FSkillMatchPlayer
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000000000]              
	float                                              PctTimePlayed;                                    		// 0x0048 (0x0004) [0x0000000000000000]              
	unsigned long                                      bQuitter : 1;                                     		// 0x004C (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                PartyID;                                          		// 0x0050 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.PartyJoinMatchSettings
// 0x002C
struct FPartyJoinMatchSettings
{
	struct FString                                     BeaconAddress;                                    		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     GameAddress;                                      		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                PlaylistId;                                       		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned long                                      bFriendJoin : 1;                                  		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     Password;                                         		// 0x0020 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.ServerResult
// 0x0078
struct FServerResult
{
	struct FString                                     Address;                                          		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ServerName;                                       		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FCustomMatchSettings                        Settings;                                         		// 0x0018 (0x0060) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.IntVector3
// 0x000C
struct FIntVector3
{
	int                                                X;                                                		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Y;                                                		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Z;                                                		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct ProjectX._Types_X.DownloadedImage
// 0x0010
struct FDownloadedImage
{
	struct FString                                     URL;                                              		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UTexture2DDynamic*                           Texture;                                          		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.CarInteractionConfig
// 0x0020
struct FCarInteractionConfig
{
	float                                              PushFactor;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              BumperPushFactor;                                 		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              ZPushFactor;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              BumpInterval;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              BumperHitNormalAngle;                             		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              BumperCarLocationAngle;                           		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              BumperHitDepth;                                   		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned long                                      bCheckHitNormal : 1;                              		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bCheckExtent : 1;                                 		// 0x001C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bCheckCarAngle : 1;                               		// 0x001C (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct ProjectX._Types_X.SuperSonicConfig
// 0x000C
struct FSuperSonicConfig
{
	float                                              Speed;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              TurnoffSpeedBuffer;                               		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              TurnoffTime;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.SkillRating
// 0x0008
struct FSkillRating
{
	float                                              Mu;                                               		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              Sigma;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.ReservationData
// 0x00D4
struct FReservationData
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000000000]              
	struct FString                                     PlayerName;                                       		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FUniqueNetId                                PartyID;                                          		// 0x0054 (0x0048) [0x0000000000000000]              
	unsigned char                                      Status;                                           		// 0x009C (0x0001) [0x0000000000000000]              
	float                                              TimeoutTime;                                      		// 0x00A0 (0x0004) [0x0000000000000000]              
	unsigned long                                      bDisableCrossPlay : 1;                            		// 0x00A4 (0x0004) [0x0000000000000000] [0x00000001] 
	class APlayerReplicationInfo*                      PRI;                                              		// 0x00A8 (0x0004) [0x0000000000000000]              
	unsigned char                                      Team;                                             		// 0x00AC (0x0001) [0x0000000000000000]              
	class UTcpConnection*                              Connection;                                       		// 0x00B0 (0x0004) [0x0000000000000000]              
	struct FSkillRating                                Skill;                                            		// 0x00B4 (0x0008) [0x0000000000000000]              
	TArray< struct FName >                             MapLikes;                                         		// 0x00BC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FName >                             MapDislikes;                                      		// 0x00C8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.CheckReservationData
// 0x001C
struct FCheckReservationData
{
	struct FString                                     Address;                                          		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ServerName;                                       		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                Playlist;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.PlayerTitleData
// 0x0015
struct FPlayerTitleData
{
	struct FName                                       Id;                                               		// 0x0000 (0x0008) [0x0000000040000000]              ( CPF_EditInlineNotify )
	struct FString                                     Text;                                             		// 0x0008 (0x000C) [0x0000000040400000]              ( CPF_NeedCtorLink | CPF_EditInlineNotify )
	unsigned char                                      Type;                                             		// 0x0014 (0x0001) [0x0000000040000000]              ( CPF_EditInlineNotify )
};

// ScriptStruct ProjectX._Types_X.PlayerSeasonRewardProgress
// 0x0050
struct FPlayerSeasonRewardProgress
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000000000]              
	int                                                Level;                                            		// 0x0048 (0x0004) [0x0000000000000000]              
	int                                                Wins;                                             		// 0x004C (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.MapPrefs
// 0x0018
struct FMapPrefs
{
	TArray< struct FName >                             Likes;                                            		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FName >                             Dislikes;                                         		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.CrossplayGroup
// 0x000C
struct FCrossplayGroup
{
	TArray< unsigned char >                            Platforms;                                        		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.TierSkillRating
// 0x0010(0x0018 - 0x0008)
struct FTierSkillRating : FSkillRating
{
	int                                                Tier;                                             		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                Division;                                         		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                MatchesPlayed;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              MMR;                                              		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.GroupSkillRating
// 0x000C(0x0024 - 0x0018)
struct FGroupSkillRating : FTierSkillRating
{
	TArray< struct FUniqueNetId >                      Players;                                          		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.SkillMatchPartyRating
// 0x0004(0x001C - 0x0018)
struct FSkillMatchPartyRating : FTierSkillRating
{
	int                                                PartyID;                                          		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.SkillMatchParty
// 0x0018
struct FSkillMatchParty
{
	int                                                PartyID;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              PctTimePlayed;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned long                                      bQuitter : 1;                                     		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	TArray< struct FUniqueNetId >                      Players;                                          		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.RecordedMatchData
// 0x001C
struct FRecordedMatchData
{
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x0000 (0x0008) UNKNOWN PROPERTY: QWordProperty ProjectX._Types_X.RecordedMatchData.ServerID
	int                                                Playlist;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                WinningTeam;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                Team0Score;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                Team1Score;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	unsigned long                                      bOverTime : 1;                                    		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX._Types_X.RecordedMatchPlayer
// 0x0058
struct FRecordedMatchPlayer
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000000000]              
	int                                                Team;                                             		// 0x0048 (0x0004) [0x0000000000000000]              
	float                                              TimePlayed;                                       		// 0x004C (0x0004) [0x0000000000000000]              
	unsigned long                                      bInGame : 1;                                      		// 0x0050 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bQuitter : 1;                                     		// 0x0050 (0x0004) [0x0000000000000000] [0x00000002] 
	int                                                PartyID;                                          		// 0x0054 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.LastTimePeriodLeaderData
// 0x001C
struct FLastTimePeriodLeaderData
{
	struct FString                                     LeaderboardId;                                    		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           PlayerNames;                                      		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                Value;                                            		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.ReplicatedReservationData
// 0x0055
struct FReplicatedReservationData
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000000000]              
	struct FString                                     PlayerName;                                       		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      Status;                                           		// 0x0054 (0x0001) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.ReservationPlayerData
// 0x0088
struct FReservationPlayerData
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000000000]              
	struct FString                                     PlayerName;                                       		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              SkillMu;                                          		// 0x0054 (0x0004) [0x0000000000000000]              
	float                                              SkillSigma;                                       		// 0x0058 (0x0004) [0x0000000000000000]              
	int                                                Tier;                                             		// 0x005C (0x0004) [0x0000000000000000]              
	unsigned long                                      bRemotePlayer : 1;                                		// 0x0060 (0x0004) [0x0000000000000000] [0x00000001] 
	TArray< int >                                      Loadout;                                          		// 0x0064 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FName >                             MapLikes;                                         		// 0x0070 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FName >                             MapDislikes;                                      		// 0x007C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.GamePlaylist
// 0x0020
struct FGamePlaylist
{
	struct FString                                     FriendlyName;                                     		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FName                                       Id;                                               		// 0x000C (0x0008) [0x0000000000000000]              
	TArray< struct FName >                             GameTags;                                         		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.ReplicatedRBState
// 0x0038
struct FReplicatedRBState
{
	struct FVector                                     Location;                                         		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FRotator                                    Rotation;                                         		// 0x000C (0x000C) [0x0000000000000000]              
	struct FVector                                     LinearVelocity;                                   		// 0x0018 (0x000C) [0x0000000000000000]              
	struct FVector                                     AngularVelocity;                                  		// 0x0024 (0x000C) [0x0000000000000000]              
	unsigned long                                      bSleeping : 1;                                    		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bNewData : 1;                                     		// 0x0030 (0x0004) [0x0000000000000000] [0x00000002] 
	float                                              Time;                                             		// 0x0034 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.ProcedureKeyValuePair
// 0x0014
struct FProcedureKeyValuePair
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FString                                     Value;                                            		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.ProcedureResult
// 0x000C
struct FProcedureResult
{
	TArray< struct FProcedureKeyValuePair >            KVPairs;                                          		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.UITimer
// 0x000C
struct FUITimer
{
	struct FName                                       Event;                                            		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              Delay;                                            		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct ProjectX._Types_X.UIAnimValue
// 0x0018
struct FUIAnimValue
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              R;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              G;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              B;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              A;                                                		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.UIWidgetMatrix
// 0x0034
struct FUIWidgetMatrix
{
	struct FVector                                     Position;                                         		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FVector                                     Size;                                             		// 0x000C (0x000C) [0x0000000000000000]              
	struct FVector                                     Scale;                                            		// 0x0018 (0x000C) [0x0000000000000000]              
	struct FLinearColor                                Tint;                                             		// 0x0024 (0x0010) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.CustomAnimSettings
// 0x0034
struct FCustomAnimSettings
{
	struct FName                                       AnimName;                                         		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bLoop : 1;                                        		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	float                                              BlendInTime;                                      		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BlendOutTime;                                     		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              StartTime;                                        		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              EndTime;                                          		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Rate;                                             		// 0x001C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      RootMotionMode;                                   		// 0x0020 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      RootBoneAxis;                                     		// 0x0021 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      RootMotionRotationMode;                           		// 0x0022 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      RootBoneRotationAxis;                             		// 0x0023 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     RootMotionAccelScale;                             		// 0x0024 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bOverride : 1;                                    		// 0x0030 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bMirrored : 1;                                    		// 0x0030 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
};

// ScriptStruct ProjectX._Types_X.Ray
// 0x0018
struct FRay
{
	struct FVector                                     Origin;                                           		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FVector                                     Dir;                                              		// 0x000C (0x000C) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.PlayerBinding
// 0x002C
struct FPlayerBinding
{
	struct FName                                       Action;                                           		// 0x0000 (0x0008) [0x0000000040000000]              ( CPF_EditInlineNotify )
	struct FName                                       Key;                                              		// 0x0008 (0x0008) [0x0000000040000000]              ( CPF_EditInlineNotify )
	unsigned char                                      AxisSign;                                         		// 0x0010 (0x0001) [0x0000000040000000]              ( CPF_EditInlineNotify )
	unsigned char                                      PressType;                                        		// 0x0011 (0x0001) [0x0000000040000000]              ( CPF_EditInlineNotify )
	float                                              Speed;                                            		// 0x0014 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	unsigned long                                      bRequired : 1;                                    		// 0x0018 (0x0004) [0x0000000040000000] [0x00000001] ( CPF_EditInlineNotify )
	unsigned char                                      Remappable;                                       		// 0x001C (0x0001) [0x0000000000000000]              
	float                                              PressedTime;                                      		// 0x0020 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              ReleasedTime;                                     		// 0x0024 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bTapped : 1;                                      		// 0x0028 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bToggled : 1;                                     		// 0x0028 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
};

// ScriptStruct ProjectX._Types_X.BindingAction
// 0x0030
struct FBindingAction
{
	struct FName                                       Action;                                           		// 0x0000 (0x0008) [0x0000000040000000]              ( CPF_EditInlineNotify )
	struct FName                                       Category;                                         		// 0x0008 (0x0008) [0x0000000040000000]              ( CPF_EditInlineNotify )
	struct FName                                       Axis;                                             		// 0x0010 (0x0008) [0x0000000040000000]              ( CPF_EditInlineNotify )
	unsigned char                                      AxisSign;                                         		// 0x0018 (0x0001) [0x0000000040000000]              ( CPF_EditInlineNotify )
	struct FString                                     Command;                                          		// 0x001C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bDisableRemapping : 1;                            		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                Priority;                                         		// 0x002C (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.KeyHandler
// 0x0018
struct FKeyHandler
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FScriptDelegate                             Handler;                                          		// 0x0008 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x000C (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
};

// ScriptStruct ProjectX._Types_X.PlaylistTierSkillRating
// 0x0004(0x001C - 0x0018)
struct FPlaylistTierSkillRating : FTierSkillRating
{
	int                                                Playlist;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.PlayerSkillRating
// 0x0048(0x0060 - 0x0018)
struct FPlayerSkillRating : FTierSkillRating
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0018 (0x0048) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.PlaylistSkillRating
// 0x0004(0x0064 - 0x0060)
struct FPlaylistSkillRating : FPlayerSkillRating
{
	int                                                Playlist;                                         		// 0x0060 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.RPCRewardLevelData
// 0x0008
struct FRPCRewardLevelData
{
	int                                                SeasonLevel;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                SeasonLevelWins;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.RPCPlayerRewardLevelData
// 0x0048(0x0050 - 0x0008)
struct FRPCPlayerRewardLevelData : FRPCRewardLevelData
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0008 (0x0048) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.CachedRegionPing
// 0x000C
struct FCachedRegionPing
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              Ping;                                             		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.PartyMemberServer
// 0x001C
struct FPartyMemberServer
{
	struct FString                                     BeaconAddress;                                    		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Password;                                         		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                PlaylistId;                                       		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.PartyMember
// 0x0120
struct FPartyMember
{
	struct FUniqueNetId                                PrimaryMemberId;                                  		// 0x0000 (0x0048) [0x0000000000000000]              
	struct FUniqueNetId                                MemberId;                                         		// 0x0048 (0x0048) [0x0000000000000000]              
	struct FString                                     MemberName;                                       		// 0x0090 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                MatchmakeRestrictions;                            		// 0x009C (0x0004) [0x0000000000000000]              
	int                                                LocalControllerId;                                		// 0x00A0 (0x0004) [0x0000000000000000]              
	unsigned long                                      bDisableCrossPlay : 1;                            		// 0x00A4 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FUniqueNetId                                TradingMemberId;                                  		// 0x00A8 (0x0048) [0x0000000000000000]              
	struct FGuid                                       TradeId;                                          		// 0x00F0 (0x0010) [0x0000000000000000]              
	unsigned long                                      bReadyToTrade : 1;                                		// 0x0100 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FPartyMemberServer                          Server;                                           		// 0x0104 (0x001C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.RenderProfile
// 0x0024
struct FRenderProfile
{
	float                                              GameThreadTime;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              RenderThreadTime;                                 		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              GPUTime;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              FrameTime;                                        		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              AccumGameThreadTime;                              		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              AccumRenderThreadTime;                            		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              AccumGPUTime;                                     		// 0x0018 (0x0004) [0x0000000000000000]              
	float                                              AccumFrameTime;                                   		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                NumSamples;                                       		// 0x0020 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX._Types_X.MetricsEvent
// 0x001C
struct FMetricsEvent
{
	float                                              TimeSeconds;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     EventName;                                        		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     EventData;                                        		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.ClubMember
// 0x0054
struct FClubMember
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000000000]              
	struct FString                                     PlayerName;                                       		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX._Types_X.PlayerPermissionsList
// 0x0054
struct FPlayerPermissionsList
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000000000]              
	TArray< unsigned char >                            Permissions;                                      		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX.AddReservationMessagePublic_X.OnlinePlayerMapPrefs
// 0x0060
struct FOnlinePlayerMapPrefs
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000000000]              
	TArray< struct FName >                             MapLikes;                                         		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FName >                             MapDislikes;                                      		// 0x0054 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX.AnimateParametersComponent_X.AnimatedParam
// 0x0008
struct FAnimatedParam
{
	struct FName                                       ParamName;                                        		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct ProjectX.AnimateParametersComponent_X.AnimatedFloatParam
// 0x0010(0x0018 - 0x0008)
struct FAnimatedFloatParam : FAnimatedParam
{
	struct FInterpCurveFloat                           ValueOverTime;                                    		// 0x0008 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct ProjectX.AnimateParametersComponent_X.AnimatedVectorParam
// 0x0010(0x0018 - 0x0008)
struct FAnimatedVectorParam : FAnimatedParam
{
	struct FInterpCurveVector                          ValueOverTime;                                    		// 0x0008 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct ProjectX.AnimateParametersComponent_X.AnimatedLinearColorParam
// 0x0010(0x0018 - 0x0008)
struct FAnimatedLinearColorParam : FAnimatedParam
{
	struct FInterpCurveLinearColor                     ValueOverTime;                                    		// 0x0008 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct ProjectX.BugReport_X.BugReportSubmitterData
// 0x0028
struct FBugReportSubmitterData
{
	class APlayerController*                           Submitter;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     Name;                                             		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FVector                                     Location;                                         		// 0x0010 (0x000C) [0x0000000000000000]              
	struct FRotator                                    Rotation;                                         		// 0x001C (0x000C) [0x0000000000000000]              
};

// ScriptStruct ProjectX.BugReport_X.BugReportSystemData
// 0x0028
struct FBugReportSystemData
{
	struct FString                                     ComputerName;                                     		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     GameName;                                         		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     NetMode;                                          		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bClient : 1;                                      		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX.BugReport_X.BugReportPathData
// 0x0030
struct FBugReportPathData
{
	struct FString                                     OutputPath;                                       		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     LogName;                                          		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     LogPath;                                          		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ScreenShotPath;                                   		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX.BugReport_X.BugReportDescriptionData
// 0x003C
struct FBugReportDescriptionData
{
	struct FString                                     Title;                                            		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ShortTitle;                                       		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     MetaTitle;                                        		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Description;                                      		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Email;                                            		// 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX.BugReport_X.FileUploadData
// 0x0030
struct FFileUploadData
{
	class UBugReport_X*                                BugReport;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     BugID;                                            		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Folder;                                           		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     FilePath;                                         		// 0x001C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      TruncateType;                                     		// 0x0028 (0x0001) [0x0000000000000000]              
	unsigned long                                      bIsBacktraceMinidump : 1;                         		// 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX.BugReport_X.BugReportUploadTask
// 0x0074
struct FBugReportUploadTask
{
	struct FFileUploadData                             Data;                                             		// 0x0000 (0x0030) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FBugReportSystemData                        SystemData;                                       		// 0x0030 (0x0028) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UHttpRequestInterface*                       HTTPRequest;                                      		// 0x0058 (0x0004) [0x0000000000000000]              
	struct FString                                     TaskName;                                         		// 0x005C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     Error;                                            		// 0x0068 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX.Camera_X.CameraKnockBase
// 0x0010
struct FCameraKnockBase
{
	float                                              BlendInTime;                                      		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BlendOutTime;                                     		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Falloff;                                          		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Time;                                             		// 0x000C (0x0004) [0x0000000000002000]              ( CPF_Transient )
};

// ScriptStruct ProjectX.Camera_X.CameraOrientation
// 0x002C
struct FCameraOrientation
{
	struct FVector                                     Focus;                                            		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FRotator                                    Rotation;                                         		// 0x000C (0x000C) [0x0000000000000000]              
	float                                              Distance;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
	float                                              FOV;                                              		// 0x001C (0x0004) [0x0000000000000000]              
	struct FVector                                     CalculatedLocation;                               		// 0x0020 (0x000C) [0x0000000000000000]              
};

// ScriptStruct ProjectX.CameraStateBlender_X.CameraTransition
// 0x0048
struct FCameraTransition
{
	class UCameraState_X*                              CameraState;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FViewTargetTransitionParams                 BlendParams;                                      		// 0x0004 (0x0010) [0x0000000000000000]              
	float                                              RemainingTime;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FCameraOrientation                          SnapshotPOV;                                      		// 0x0018 (0x002C) [0x0000000000000000]              
	unsigned long                                      bStarted : 1;                                     		// 0x0044 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX.Camera_X.RotationCameraKnock
// 0x000C(0x001C - 0x0010)
struct FRotationCameraKnock : FCameraKnockBase
{
	struct FRotator                                    Amount;                                           		// 0x0010 (0x000C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct ProjectX.Camera_X.LocationCameraKnock
// 0x000C(0x001C - 0x0010)
struct FLocationCameraKnock : FCameraKnockBase
{
	struct FVector                                     Amount;                                           		// 0x0010 (0x000C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct ProjectX.Camera_X.VectorInterpRate
// 0x0018
struct FVectorInterpRate
{
	float                                              MaxDistance;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              InterpRate;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              ForwardScale;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              BackwardScale;                                    		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              SideScale;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              UpDownScale;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct ProjectX.CheatManager_X.TestStructEvent
// 0x0010
struct FTestStructEvent
{
	struct FScriptDelegate                             Callback;                                         		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0004 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
};

// ScriptStruct ProjectX.EffectsMap_X.EffectsMapping
// 0x0008
struct FEffectsMapping
{
	class UPhysicalMaterial*                           PhysicalMaterial;                                 		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UParticleSystem*                             Particle;                                         		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct ProjectX.EngineShare_X.DynamicallyLoadedPackage
// 0x0018
struct FDynamicallyLoadedPackage
{
	struct FString                                     Tag;                                              		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     PackageName;                                      		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct ProjectX.ParameterDispenser_X.NameParamPair
// 0x0010
struct FNameParamPair
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Value;                                            		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct ProjectX.ParameterDispenser_X.FloatParamPair
// 0x000C
struct FFloatParamPair
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              Value;                                            		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct ProjectX.ParameterDispenser_X.VectorParamPair
// 0x0014
struct FVectorParamPair
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     Value;                                            		// 0x0008 (0x000C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct ProjectX.ParameterDispenser_X.ColorParamPair
// 0x0018
struct FColorParamPair
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Value;                                            		// 0x0008 (0x0010) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct ProjectX.ParameterDispenser_X.ActorParamPair
// 0x000C
struct FActorParamPair
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class AActor*                                      Value;                                            		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct ProjectX.FXActor_X.FXAttachment
// 0x00C8
struct FFXAttachment
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       SkeletalMeshAttachName;                           		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       SocketOrBoneName;                                 		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       AttachToParameter;                                		// 0x0018 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              AttachDelay;                                      		// 0x0020 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DetachDelay;                                      		// 0x0024 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Lifetime;                                         		// 0x0028 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bCreateDuplicates : 1;                            		// 0x002C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      Target;                                           		// 0x0030 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	class UActorComponent*                             Component;                                        		// 0x0034 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	TArray< class UFXActorEvent_X* >                   AttachAny;                                        		// 0x0038 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class UFXActorEvent_X* >                   DetachAny;                                        		// 0x0044 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class UFXActorEvent_X* >                   AttachAll;                                        		// 0x0050 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bExistingComponent : 1;                           		// 0x005C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bExistingAttachment : 1;                          		// 0x005C (0x0004) [0x0000000000000000] [0x00000002] 
	float                                              AttachedTime;                                     		// 0x0060 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned char                                      State;                                            		// 0x0064 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bWantsAttachment : 1;                             		// 0x0068 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	float                                              WantsAttachmentChangeTime;                        		// 0x006C (0x0004) [0x0000000000002000]              ( CPF_Transient )
