/*
#############################################################################################
# RocketLeague (1.0.10897.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: ProjectX_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function ProjectX._SharedHelpers.ScoreDeltaFromDefault
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct U_SharedHelpers_execScoreDeltaFromDefault_Parms
{
	class UObject*                                     Object;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX._SharedHelpers.FindNetId
// [0x00C22003] ( FUNC_Final )
struct U_SharedHelpers_execFindNetId_Parms
{
	struct FUniqueNetId                                FindId;                                           		// 0x0000 (0x0048) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FUniqueNetId >                      List;                                             		// 0x0048 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0054 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FUniqueNetId                             SearchId;                                         		// 0x0058 (0x0048) [0x0000000000000000]              
	// int                                             Index;                                            		// 0x00A0 (0x0004) [0x0000000000000000]              
};

// Function ProjectX._SharedHelpers.DrawShadowedText
// [0x00826002] 
struct U_SharedHelpers_execDrawShadowedText_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Text;                                             		// 0x0004 (0x000C) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )
	int                                                ShadowOffsetX;                                    		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                ShadowOffsetY;                                    		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                ShadowAlpha;                                      		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// float                                           X;                                                		// 0x001C (0x0004) [0x0000000000000000]              
	// float                                           Y;                                                		// 0x0020 (0x0004) [0x0000000000000000]              
	// struct FColor                                   C;                                                		// 0x0024 (0x0004) [0x0000000000000000]              
};

// Function ProjectX._SharedHelpers.IsInTransientPackage
// [0x00022400] ( FUNC_Native )
struct U_SharedHelpers_execIsInTransientPackage_Parms
{
	class UObject*                                     Obj;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX._SharedHelpers.GetAPlayerController
// [0x00026400] ( FUNC_Native )
struct U_SharedHelpers_execGetAPlayerController_Parms
{
	class UClass*                                      PlayerControllerClass;                            		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class APlayerController*                           ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000D80]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm )
};

// Function ProjectX._SharedHelpers.GetDefaultObject
// [0x00022400] ( FUNC_Native )
struct U_SharedHelpers_execGetDefaultObject_Parms
{
	class UClass*                                      ObjClass;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000D80]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm )
};

// Function ProjectX._SharedHelpers.DumpUnreferencedAnims
// [0x00022400] ( FUNC_Native )
struct U_SharedHelpers_execDumpUnreferencedAnims_Parms
{
};

// Function ProjectX._SharedHelpers.GetLanguageExtension
// [0x00022400] ( FUNC_Native )
struct U_SharedHelpers_execGetLanguageExtension_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ProjectX._Types_X.ServiceExecutionDelegate
// [0x00120000] 
struct U_Types_X_execServiceExecutionDelegate_Parms
{
	class UPsyNetClientService_X*                      Service;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX._Types_X.ToIntVector3
// [0x00822003] ( FUNC_Final )
struct U_Types_X_execToIntVector3_Parms
{
	struct FVector                                     V;                                                		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FIntVector3                                 ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FIntVector3                              OutV;                                             		// 0x0018 (0x000C) [0x0000000000000000]              
};

// Function ProjectX._Types_X.OnPriviledgeChecked
// [0x00120000] 
struct U_Types_X_execOnPriviledgeChecked_Parms
{
	class UPrivilegeCheck_X*                           PrivilegeCheck;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX._Types_X.KeyPressDelegate
// [0x00120000] 
struct U_Types_X_execKeyPressDelegate_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.ActorComponent_X.Reattach
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UActorComponent_X_execReattach_Parms
{
};

// Function ProjectX.ActorComponent_X.Tick
// [0x00080800] ( FUNC_Event )
struct UActorComponent_X_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.ActorComponent_X.Detached
// [0x00080800] ( FUNC_Event )
struct UActorComponent_X_eventDetached_Parms
{
};

// Function ProjectX.ActorComponent_X.Attached
// [0x00080800] ( FUNC_Event )
struct UActorComponent_X_eventAttached_Parms
{
};

// Function ProjectX.ActorComponent_X.BeginPlay
// [0x00080800] ( FUNC_Event )
struct UActorComponent_X_eventBeginPlay_Parms
{
};

// Function ProjectX.ExplosionComponent_X.ProcessHit
// [0x00024802] ( FUNC_Event )
struct UExplosionComponent_X_eventProcessHit_Parms
{
	class AActor*                                      Victim;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               ExtraHitInfo;                                     		// 0x0010 (0x001C) [0x0000000000000080]              ( CPF_Parm )
	float                                              DamageScale;                                      		// 0x002C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function ProjectX.ExplosionComponent_X.Detached
// [0x00080802] ( FUNC_Event )
struct UExplosionComponent_X_eventDetached_Parms
{
};

// Function ProjectX.MICParamDispenserComponent_X.__MICParamDispenserComponent_X__Attached
// [0x40040003] ( FUNC_Final )
struct UMICParamDispenserComponent_X_exec__MICParamDispenserComponent_X__Attached_Parms
{
	struct FFXAttachment                               A;                                                		// 0x0000 (0x00D0) [0x0000000000480080]              ( CPF_Parm | CPF_Component | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x00D0 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.MICParamDispenserComponent_X.Attached
// [0x00080802] ( FUNC_Event )
struct UMICParamDispenserComponent_X_eventAttached_Parms
{
	// class AFXActor_X*                               FXActor;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.MICParamDispenserComponent_X.SetActorParameter
// [0x00020400] ( FUNC_Native )
struct UMICParamDispenserComponent_X_execSetActorParameter_Parms
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Value;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.MICParamDispenserComponent_X.SetLinearColorParameter
// [0x00020400] ( FUNC_Native )
struct UMICParamDispenserComponent_X_execSetLinearColorParameter_Parms
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FLinearColor                                Value;                                            		// 0x0008 (0x0010) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.MICParamDispenserComponent_X.SetVectorParameter
// [0x00020400] ( FUNC_Native )
struct UMICParamDispenserComponent_X_execSetVectorParameter_Parms
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Value;                                            		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.MICParamDispenserComponent_X.SetFloatParameter
// [0x00020400] ( FUNC_Native )
struct UMICParamDispenserComponent_X_execSetFloatParameter_Parms
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Value;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.MICParamDispenserComponent_X.SetNameParameter
// [0x00020400] ( FUNC_Native )
struct UMICParamDispenserComponent_X_execSetNameParameter_Parms
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       Value;                                            		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.ShakeComponent_X.GetColorParameter
// [0x00420400] ( FUNC_Native )
struct UShakeComponent_X_execGetColorParameter_Parms
{
	struct FName                                       InName;                                           		// 0x0000 (0x0008) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	struct FColor                                      OutColor;                                         		// 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.ShakeComponent_X.GetVectorParameter
// [0x00420400] ( FUNC_Native )
struct UShakeComponent_X_execGetVectorParameter_Parms
{
	struct FName                                       InName;                                           		// 0x0000 (0x0008) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	struct FVector                                     OutVector;                                        		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.ShakeComponent_X.GetFloatParameter
// [0x00420400] ( FUNC_Native )
struct UShakeComponent_X_execGetFloatParameter_Parms
{
	struct FName                                       InName;                                           		// 0x0000 (0x0008) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	float                                              OutFloat;                                         		// 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.ShakeComponent_X.SetColorParameter
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UShakeComponent_X_execSetColorParameter_Parms
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FColor                                      Param;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.ShakeComponent_X.SetVectorRandParameter
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UShakeComponent_X_execSetVectorRandParameter_Parms
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Param;                                            		// 0x0008 (0x000C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	struct FVector                                     ParamLow;                                         		// 0x0014 (0x000C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
};

// Function ProjectX.ShakeComponent_X.SetVectorParameter
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UShakeComponent_X_execSetVectorParameter_Parms
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Param;                                            		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.ShakeComponent_X.SetFloatRandParameter
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UShakeComponent_X_execSetFloatRandParameter_Parms
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Param;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ParamLow;                                         		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.ShakeComponent_X.SetFloatParameter
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UShakeComponent_X_execSetFloatParameter_Parms
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Param;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.ShakeComponent_X.IsPlaying
// [0x00020003] ( FUNC_Final )
struct UShakeComponent_X_execIsPlaying_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.ShakeComponent_X.StopShake
// [0x00024802] ( FUNC_Event )
struct UShakeComponent_X_eventStopShake_Parms
{
	float                                              InBlendOutTime;                                   		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function ProjectX.ShakeComponent_X.InitParams
// [0x00080400] ( FUNC_Native )
struct UShakeComponent_X_execInitParams_Parms
{
};

// Function ProjectX.ShakeComponent_X.PlayShake
// [0x00020802] ( FUNC_Event )
struct UShakeComponent_X_eventPlayShake_Parms
{
};

// Function ProjectX.ShakeComponent_X.Detached
// [0x00080802] ( FUNC_Event )
struct UShakeComponent_X_eventDetached_Parms
{
};

// Function ProjectX.ShakeComponent_X.Attached
// [0x00080802] ( FUNC_Event )
struct UShakeComponent_X_eventAttached_Parms
{
};

// Function ProjectX.AdHocBeacon_X.GetNodeCountMax
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execGetNodeCountMax_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.AdHocBeacon_X.AdHocJoinMatch
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocJoinMatch_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocCreateMatch
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocCreateMatch_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocIsActive
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocIsActive_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.AdHocBeacon_X.AdHocDisconnectFromAccessPoint
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocDisconnectFromAccessPoint_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocConnectToAccessPoint
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocConnectToAccessPoint_Parms
{
	int                                                ScanResultIndex;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.AdHocBeacon_X.AdHocRevertToInitialized
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocRevertToInitialized_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocScanForAccessPoints
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocScanForAccessPoints_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocBecomeStation
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocBecomeStation_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocRejectStation
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocRejectStation_Parms
{
	int                                                NetworkNodeIndex;                                 		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.AdHocBeacon_X.AdHocBecomeAccessPoint
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocBecomeAccessPoint_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocSetAdvertiseData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocSetAdvertiseData_Parms
{
	struct FString                                     AdvertiseData;                                    		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function ProjectX.AdHocBeacon_X.AdHocDestroy
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocDestroy_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocCreate
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocCreate_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocCreateWithUsername
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UAdHocBeacon_X_execAdHocCreateWithUsername_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function ProjectX.AdHocBeacon_X.Construct
// [0x00020802] ( FUNC_Event )
struct UAdHocBeacon_X_eventConstruct_Parms
{
};

// Function ProjectX.FXActor_X.Destroyed
// [0x00020802] ( FUNC_Event )
struct AFXActor_X_eventDestroyed_Parms
{
};

// Function ProjectX.FXActor_X.OnToggle
// [0x00020102] 
struct AFXActor_X_execOnToggle_Parms
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.FXActor_X.OnTriggerFXActor_X
// [0x00020102] 
struct AFXActor_X_execOnTriggerFXActor_X_Parms
{
	class USeqAct_TriggerFXActor_X*                    SeqAct;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class AActor*                                   AttachTo;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.FXActor_X.Inherit
// [0x00880102] 
struct AFXActor_X_execInherit_Parms
{
	class AFXActor_X*                                  Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             OtherIdx;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	// struct FFXAttachment                            NewAttachment;                                    		// 0x0010 (0x00D0) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function ProjectX.FXActor_X.CopyFrom
// [0x00020102] 
struct AFXActor_X_execCopyFrom_Parms
{
	class AFXActor_X*                                  Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             AttachmentIdx;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.FXActor_X.ResetParticles
// [0x00020103] ( FUNC_Final )
struct AFXActor_X_execResetParticles_Parms
{
	// class UParticleSystemComponent*                 PSC;                                              		// 0x0000 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function ProjectX.FXActor_X.StopAllEffects
// [0x00080102] 
struct AFXActor_X_execStopAllEffects_Parms
{
};

// Function ProjectX.FXActor_X.DeactivateAndDestroy
// [0x00020903] ( FUNC_Final | FUNC_Event )
struct AFXActor_X_eventDeactivateAndDestroy_Parms
{
};

// Function ProjectX.FXActor_X.OnDetached
// [0x00080902] ( FUNC_Event )
struct AFXActor_X_eventOnDetached_Parms
{
	class UActorComponent*                             AC;                                               		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function ProjectX.FXActor_X.DeactivateFXComponent
// [0x00020902] ( FUNC_Event )
struct AFXActor_X_eventDeactivateFXComponent_Parms
{
	class UActorComponent*                             AC;                                               		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function ProjectX.FXActor_X.ActivateFXComponent
// [0x00080902] ( FUNC_Event )
struct AFXActor_X_eventActivateFXComponent_Parms
{
	class UActorComponent*                             AC;                                               		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function ProjectX.FXActor_X.OnAttached
// [0x00080902] ( FUNC_Event )
struct AFXActor_X_eventOnAttached_Parms
{
	class UActorComponent*                             AC;                                               		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	// class USkeletalMeshComponent*                   AttachmentMesh;                                   		// 0x0004 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
	// class UPrimitiveComponent*                      PrimComp;                                         		// 0x0008 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
	// int                                             AttachmentIdx;                                    		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function ProjectX.FXActor_X.UpdateFXStates
// [0x00080500] ( FUNC_Native )
struct AFXActor_X_execUpdateFXStates_Parms
{
};

// Function ProjectX.FXActor_X.IsLocallyControlled
// [0x00080501] ( FUNC_Final | FUNC_Native )
struct AFXActor_X_execIsLocallyControlled_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.FXActor_X.GetControllerOwner
// [0x00080501] ( FUNC_Final | FUNC_Native )
struct AFXActor_X_execGetControllerOwner_Parms
{
	class AController*                                 ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.FXActor_X.ToggleState
// [0x00020500] ( FUNC_Native )
struct AFXActor_X_execToggleState_Parms
{
	class UFXActorEvent_X*                             NewState;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.FXActor_X.RemoveState
// [0x00020500] ( FUNC_Native )
struct AFXActor_X_execRemoveState_Parms
{
	class UFXActorEvent_X*                             OldState;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.FXActor_X.AddState
// [0x00020500] ( FUNC_Native )
struct AFXActor_X_execAddState_Parms
{
	class UFXActorEvent_X*                             NewState;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.FXActor_X.IsStateActive
// [0x00020501] ( FUNC_Final | FUNC_Native )
struct AFXActor_X_execIsStateActive_Parms
{
	class UFXActorEvent_X*                             InState;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.FXActor_X.Deactivate
// [0x00020902] ( FUNC_Event )
struct AFXActor_X_eventDeactivate_Parms
{
};

// Function ProjectX.FXActor_X.Activate
// [0x00020902] ( FUNC_Event )
struct AFXActor_X_eventActivate_Parms
{
};

// Function ProjectX.FXActor_X.HandleParentStatePopped
// [0x00040103] ( FUNC_Final )
struct AFXActor_X_execHandleParentStatePopped_Parms
{
	class AFXActor_X*                                  P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UFXActorEvent_X*                             Event;                                            		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.FXActor_X.HandleParentStatePushed
// [0x00040103] ( FUNC_Final )
struct AFXActor_X_execHandleParentStatePushed_Parms
{
	class AFXActor_X*                                  P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UFXActorEvent_X*                             Event;                                            		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.FXActor_X.BindTo
// [0x00020102] 
struct AFXActor_X_execBindTo_Parms
{
	class AFXActor_X*                                  ParentFXActor;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class UFXActorEvent_X*                          ParentState;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.FXActor_X.SetAttachmentActor
// [0x00020102] 
struct AFXActor_X_execSetAttachmentActor_Parms
{
	class AActor*                                      AttachToActor;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.FXActor_X.PostBeginPlay
// [0x00020102] 
struct AFXActor_X_execPostBeginPlay_Parms
{
};

// Function ProjectX.FXActor_X.AllAttachments
// [0x00424505] ( FUNC_Final | FUNC_Native )
struct AFXActor_X_execAllAttachments_Parms
{
	class UClass*                                      ComponentClass;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UActorComponent*                             OutComponent;                                     		// 0x0004 (0x0004) [0x0000000004000180]              ( CPF_Parm | CPF_OutParm | CPF_EditInline )
	int                                                OutAttachmentIdx;                                 		// 0x0008 (0x0004) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
};

// Function ProjectX.FXActor_X.GetComponentByName
// [0x00020501] ( FUNC_Final | FUNC_Native )
struct AFXActor_X_execGetComponentByName_Parms
{
	class UClass*                                      ComponentClass;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       ComponentName;                                    		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UActorComponent*                             ReturnValue;                                      		// 0x000C (0x0004) [0x0000000004000D80]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm | CPF_EditInline )
};

// Function ProjectX.FXActor_X.EventFXStatePopped
// [0x00120000] 
struct AFXActor_X_execEventFXStatePopped_Parms
{
	class AFXActor_X*                                  FXActor;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UFXActorEvent_X*                             Event;                                            		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.FXActor_X.EventFXStatePushed
// [0x00120000] 
struct AFXActor_X_execEventFXStatePushed_Parms
{
	class AFXActor_X*                                  FXActor;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UFXActorEvent_X*                             Event;                                            		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.ArchetypeSpawnPoint_X.OnSpawned
// [0x00080002] 
struct AArchetypeSpawnPoint_X_execOnSpawned_Parms
{
	class AActor*                                      Spawned;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class USequenceEvent*                           Evt;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.ArchetypeSpawnPoint_X.DoSpawn
// [0x00020002] 
struct AArchetypeSpawnPoint_X_execDoSpawn_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class AActor*                                   Spawned;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.ArchetypeSpawnPoint_X.OnToggle
// [0x00020002] 
struct AArchetypeSpawnPoint_X_execOnToggle_Parms
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.ArchetypeSpawnPoint_X.OnDestroy
// [0x00020102] 
struct AArchetypeSpawnPoint_X_execOnDestroy_Parms
{
	class USeqAct_Destroy*                             Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class AActor*                                   A;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.ArchetypeSpawnPoint_X.PostBeginPlay
// [0x00020802] ( FUNC_Event )
struct AArchetypeSpawnPoint_X_eventPostBeginPlay_Parms
{
};

// Function ProjectX.ArchetypeSpawnPoint_X.EventSpawned
// [0x00120000] 
struct AArchetypeSpawnPoint_X_execEventSpawned_Parms
{
	class AArchetypeSpawnPoint_X*                      SpawnPoint;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Spawned;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.Aws4Signature_X.SignRequest
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UAws4Signature_X_execSignRequest_Parms
{
	class UHttpRequestInterface*                       HTTPRequest;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.TcpBeacon.ReceivedBunch
// [0x00080400] ( FUNC_Native )
struct UTcpBeacon_execReceivedBunch_Parms
{
	class UTcpConnection*                              Connection;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.TcpBeacon.OnDisconnected
// [0x00080400] ( FUNC_Native )
struct UTcpBeacon_execOnDisconnected_Parms
{
	class UTcpConnection*                              Connection;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.TcpBeacon.OnConnected
// [0x00080400] ( FUNC_Native )
struct UTcpBeacon_execOnConnected_Parms
{
	class UTcpConnection*                              Connection;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.TcpBeacon.OnConnectionRemoved
// [0x00080802] ( FUNC_Event )
struct UTcpBeacon_eventOnConnectionRemoved_Parms
{
	class UTcpConnection*                              Connection;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.TcpBeacon.OnConnectionAdded
// [0x00080802] ( FUNC_Event )
struct UTcpBeacon_eventOnConnectionAdded_Parms
{
	class UTcpConnection*                              Connection;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.TcpBeacon.GetConnection
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTcpBeacon_execGetConnection_Parms
{
	struct FString                                     Address;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UTcpConnection*                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.TcpBeacon.Close
// [0x00020400] ( FUNC_Native )
struct UTcpBeacon_execClose_Parms
{
};

// Function ProjectX.TcpBeacon.GetExternalHostAddress
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTcpBeacon_execGetExternalHostAddress_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ProjectX.TcpBeacon.GetLocalHostAddress
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTcpBeacon_execGetLocalHostAddress_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ProjectX.TcpBeacon.BeginListen
// [0x00020400] ( FUNC_Native )
struct UTcpBeacon_execBeginListen_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.TcpBeacon.BeginConnect
// [0x00020400] ( FUNC_Native )
struct UTcpBeacon_execBeginConnect_Parms
{
	struct FString                                     Address;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UTcpConnection*                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.TcpBeacon.EventDisconnected
// [0x00120000] 
struct UTcpBeacon_execEventDisconnected_Parms
{
	class UTcpBeacon*                                  Beacon;                                           		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class UTcpConnection*                              Connection;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.TcpBeacon.EventConnected
// [0x00120000] 
struct UTcpBeacon_execEventConnected_Parms
{
	class UTcpBeacon*                                  Beacon;                                           		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class UTcpConnection*                              Connection;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.TcpMessageBeacon.BroadcastMessage
// [0x00020400] ( FUNC_Native )
struct UTcpMessageBeacon_execBroadcastMessage_Parms
{
	class UObject*                                     Message;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.TcpMessageBeacon.SendMessage
// [0x00020400] ( FUNC_Native )
struct UTcpMessageBeacon_execSendMessage_Parms
{
	class UTcpConnection*                              Connection;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     Message;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.TcpMessageBeacon.CreateMessage
// [0x00020400] ( FUNC_Native )
struct UTcpMessageBeacon_execCreateMessage_Parms
{
	class UClass*                                      MessageClass;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UBeaconMessage_X*                            ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000D80]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm )
};

// Function ProjectX.TcpMessageBeacon.RemoveMessageHandler
// [0x00020400] ( FUNC_Native )
struct UTcpMessageBeacon_execRemoveMessageHandler_Parms
{
	struct FScriptDelegate                             Callback;                                         		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function ProjectX.TcpMessageBeacon.AddMessageHandler
// [0x00020400] ( FUNC_Native )
struct UTcpMessageBeacon_execAddMessageHandler_Parms
{
	class UClass*                                      MessageClass;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FScriptDelegate                             Callback;                                         		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function ProjectX.TcpMessageBeacon.MessageReceivedDelegate
// [0x00140001] ( FUNC_Final )
struct UTcpMessageBeacon_execMessageReceivedDelegate_Parms
{
	class UTcpConnection*                              Connection;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     Message;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.BeaconMessage_X.Broadcast
// [0x00020400] ( FUNC_Native )
struct UBeaconMessage_X_execBroadcast_Parms
{
	class UBeaconMessage_X*                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.BeaconMessage_X.Send
// [0x00020400] ( FUNC_Native )
struct UBeaconMessage_X_execSend_Parms
{
	class UTcpConnection*                              Connection;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UBeaconMessage_X*                            ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.BugReport_X.HandleHttpRequestComplete
// [0x00040401] ( FUNC_Final | FUNC_Native )
struct UBugReport_X_execHandleHttpRequestComplete_Parms
{
	class UHttpRequestInterface*                       OriginalRequest;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UHttpResponseInterface*                      InHttpResponse;                                   		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bDidSucceed : 1;                                  		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function ProjectX.BugReport_X.LogText
// [0x00040401] ( FUNC_Final | FUNC_Native )
struct UBugReport_X_execLogText_Parms
{
	struct FString                                     Str;                                              		// 0x0000 (0x000C) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )
};

// Function ProjectX.BugReport_X.PDIReport
// [0x00080802] ( FUNC_Event )
struct UBugReport_X_eventPDIReport_Parms
{
	// class AActor*                                   A;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// class UDebugDrawer*                             Drawer;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.BugReport_X.CancelBugReport
// [0x00020400] ( FUNC_Native )
struct UBugReport_X_execCancelBugReport_Parms
{
};

// Function ProjectX.BugReport_X.SubmitBugReport
// [0x00024400] ( FUNC_Native )
struct UBugReport_X_execSubmitBugReport_Parms
{
	struct FString                                     Title;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     Description;                                      		// 0x000C (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     Email;                                            		// 0x0018 (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
};

// Function ProjectX.BugReport_X.StartBugReport
// [0x00020400] ( FUNC_Native )
struct UBugReport_X_execStartBugReport_Parms
{
};

// Function ProjectX.BugReport_X.StaticSubmitBugReport
// [0x00022003] ( FUNC_Final )
struct UBugReport_X_execStaticSubmitBugReport_Parms
{
	struct FString                                     Title;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function ProjectX.BugReport_X.CreateBugReport
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UBugReport_X_execCreateBugReport_Parms
{
	class UBugReport_X*                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.CachedWebData_X.GetText
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UCachedWebData_X_execGetText_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ProjectX.CachedWebData_X.UpdateData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UCachedWebData_X_execUpdateData_Parms
{
	TArray< unsigned char >                            NewData;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     NewETag;                                          		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function ProjectX.Camera_X.OnViewTargetChanged
// [0x00080800] ( FUNC_Event )
struct ACamera_X_eventOnViewTargetChanged_Parms
{
};

// Function ProjectX.Camera_X.SetViewTarget
// [0x00024400] ( FUNC_Native )
struct ACamera_X_execSetViewTarget_Parms
{
	class AActor*                                      NewViewTarget;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FViewTargetTransitionParams                 TransitionParams;                                 		// 0x0004 (0x0010) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function ProjectX.Camera_X.IsTransitioning
// [0x00020003] ( FUNC_Final )
struct ACamera_X_execIsTransitioning_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.Camera_X.HandleBlenderStateChanged
// [0x00020003] ( FUNC_Final )
struct ACamera_X_execHandleBlenderStateChanged_Parms
{
	class UCameraStateBlender_X*                       CameraBlender;                                    		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function ProjectX.Camera_X.SnapTransition
// [0x00020003] ( FUNC_Final )
struct ACamera_X_execSnapTransition_Parms
{
};

// Function ProjectX.Camera_X.PrintDebugInfo
// [0x00020102] 
struct ACamera_X_execPrintDebugInfo_Parms
{
	class UDebugDrawer*                                Drawer;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             Idx;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.Camera_X.ApplyCameraModifiers
// [0x00420400] ( FUNC_Native )
struct ACamera_X_execApplyCameraModifiers_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTPOV                                       OutPOV;                                           		// 0x0004 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function ProjectX.Camera_X.CameraTrace
// [0x00424401] ( FUNC_Final | FUNC_Native )
struct ACamera_X_execCameraTrace_Parms
{
	struct FVector                                     End;                                              		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Start;                                            		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Extent;                                           		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLoc;                                           		// 0x0024 (0x000C) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
	class AActor*                                      HitActor;                                         		// 0x0030 (0x0004) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0034 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.Camera_X.InstanceCameraState
// [0x00020002] 
struct ACamera_X_execInstanceCameraState_Parms
{
	class UCameraState_X*                              Archetype;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UCameraState_X*                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UCameraState_X*                           NewState;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.Camera_X.ModifyPostProcessSettings
// [0x00420802] ( FUNC_Event )
struct ACamera_X_eventModifyPostProcessSettings_Parms
{
	struct FPostProcessSettings                        PP;                                               		// 0x0000 (0x0150) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function ProjectX.Camera_X.ProcessViewRotation
// [0x00420002] 
struct ACamera_X_execProcessViewRotation_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    OutViewRotation;                                  		// 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    OutDeltaRot;                                      		// 0x0010 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function ProjectX.Camera_X.PostProcessCameraState
// [0x00480002] 
struct ACamera_X_execPostProcessCameraState_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FCameraOrientation                          OutPOV;                                           		// 0x0004 (0x002C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function ProjectX.Camera_X.ProcessCameraState
// [0x00480002] 
struct ACamera_X_execProcessCameraState_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FCameraOrientation                          OutPOV;                                           		// 0x0004 (0x002C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function ProjectX.Camera_X.CheckViewTarget
// [0x00420400] ( FUNC_Native )
struct ACamera_X_execCheckViewTarget_Parms
{
	struct FTViewTarget                                VT;                                               		// 0x0000 (0x002C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function ProjectX.Camera_X.CopyFade
// [0x00020002] 
struct ACamera_X_execCopyFade_Parms
{
	class ACamera_X*                                   Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.Camera_X.SetCameraFade
// [0x00024002] 
struct ACamera_X_execSetCameraFade_Parms
{
	unsigned long                                      bNewEnableFading : 1;                             		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FColor                                      NewFadeColor;                                     		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FVector2D                                   NewFadeAlpha;                                     		// 0x0008 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              NewFadeTime;                                      		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bNewFadeAudio : 1;                                		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function ProjectX.Camera_X.UpdateFade
// [0x00080102] 
struct ACamera_X_execUpdateFade_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// float                                           Blend;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.Camera_X.UpdateCamera
// [0x00020902] ( FUNC_Event )
struct ACamera_X_eventUpdateCamera_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ProjectX.Camera_X.ClampPOV
// [0x00480100] 
struct ACamera_X_execClampPOV_Parms
{
	struct FCameraOrientation                          OutPOV;                                           		// 0x0000 (0x002C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function ProjectX.Camera_X.RemoveRoll
// [0x00040003] ( FUNC_Final )
struct ACamera_X_execRemoveRoll_Parms
{
	struct FRotator                                    InRot;                                            		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.Camera_X.GetCameraState
// [0x00020003] ( FUNC_Final )
struct ACamera_X_execGetCameraState_Parms
{
	class UCameraState_X*                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ProjectX.Camera_X.SelectCameraState
// [0x00080002] 
struct ACamera_X_execSelectCameraState_Parms
{
	class UCameraState_X*                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             I;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.Camera_X.UpdateCameraState
// [0x00080002] 
struct ACamera_X_execUpdateCameraState_Parms
{
	// class UCameraState_X*                           SelectedState;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function ProjectX.Camera_X.UpdateCameraKnocks
// [0x00C80003] ( FUNC_Final )
struct ACamera_X_execUpdateCameraKnocks_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FCameraOrientation                          OutPOV;                                           		// 0x0004 (0x002C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	// int                                             I;                                                		// 0x0030 (0x0004) [0x0000000000000000]              
	// float                                           Alpha;                                            		// 0x0034 (0x0004) [0x0000000000000000]              
	// struct FLocationCameraKnock                     LocationKnock;                                    		// 0x0038 (0x001C) [0x0000000000000000]              
