/*
#############################################################################################
# RocketLeague (1.0.10897.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: ProjectX_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_InMatchmakingID                                    -2
#define CONST_MAX_CONTROLLER_IDS                                 4
#define CONST_NumFriendsPerRequest                               100
#define CONST_FriendRequestPerFrame                              5
#define CONST_MaxPing                                            1.0f
#define CONST_ClosedReason_DuplicateLogin                        "DuplicateLogin"

/*
# ========================================================================================= #
# Enums

	PFR_Empty                                          = 0,
	PFR_Mismatch                                       = 1,
	PFR_MAX                                            = 2
};*/

// Enum ProjectX.RPC_X.ERPCPriority
/*enum ERPCPriority
{
	RPC_Low                                            = 0,
	RPC_Medium                                         = 1,
	RPC_High                                           = 2,
	RPC_MAX                                            = 3
};*/

// Enum ProjectX.ShakeComponent_X.EShakeReceiver
/*enum EShakeReceiver
{
	ShakeReceiver_All                                  = 0,
	ShakeReceiver_Local                                = 1,
	ShakeReceiver_NonLocal                             = 2,
	ShakeReceiver_MAX                                  = 3
};*/

// Enum ProjectX.TcpConnection.EWebSocketState
/*enum EWebSocketState
{
	WebSocketState_NotRequired                         = 0,
	WebSocketState_NeedsHandshake                      = 1,
	WebSocketState_Connected                           = 2,
	WebSocketState_MAX                                 = 3
};*/

// Enum ProjectX.TcpConnection.ETcpConnectionState
/*enum ETcpConnectionState
{
	TcpConnectionState_Invalid                         = 0,
	TcpConnectionState_Connecting                      = 1,
	TcpConnectionState_Connected                       = 2,
	TcpConnectionState_Disconnected                    = 3,
	TcpConnectionState_MAX                             = 4
};*/

// Enum ProjectX.WebRequest_X.EWebRequestState
/*enum EWebRequestState
{
	WebRequestState_PendingSend                        = 0,
	WebRequestState_PendingResponse                    = 1,
	WebRequestState_Success                            = 2,
	WebRequestState_Error                              = 3,
	WebRequestState_MAX                                = 4
};*/

// Enum ProjectX.FakeData_X.FakeDataEnum
/*enum FakeDataEnum
{
	FakeData                                           = 0,
	FakeData01                                         = 1,
	FakeData02                                         = 2,
	FakeData_Count                                     = 3,
	FakeData_MAX                                       = 4
};*/

// Enum ProjectX.ClanforgeReservation_X.EReserveState
/*enum EReserveState
{
	ReserveState_Unitialized                           = 0,
	ReserveState_Unreserved                            = 1,
	ReserveState_Reserved                              = 2,
	ReserveState_MAX                                   = 3
};*/

// Enum ProjectX.PerCon_X.EPerConStatus
/*enum EPerConStatus
{
	PerConStatus_Disabled                              = 0,
	PerConStatus_Enabled                               = 1,
	PerConStatus_Broken                                = 2,
	PerConStatus_MAX                                   = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class ProjectX._SharedHelpers
// 0x0000 (0x003C - 0x003C)
class U_SharedHelpers : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3233 ];

		return pClassPointer;
	};

	int ScoreDeltaFromDefault ( class UObject* Object );
	int FindNetId ( struct FUniqueNetId FindId, TArray< struct FUniqueNetId >* List );
	void DrawShadowedText ( class UCanvas* Canvas, struct FString Text, int ShadowOffsetX, int ShadowOffsetY, int ShadowAlpha );
	bool IsInTransientPackage ( class UObject* Obj );
	class APlayerController* GetAPlayerController ( class UClass* PlayerControllerClass );
	class UObject* GetDefaultObject ( class UClass* ObjClass );
	void DumpUnreferencedAnims ( );
	struct FString GetLanguageExtension ( );
};

UClass* U_SharedHelpers::pClassPointer = NULL;

// Class ProjectX._Types_X
// 0x0030 (0x006C - 0x003C)
class U_Types_X : public UObject
{
public:
	struct FScriptDelegate                             __KeyPressDelegate__Delegate;                     		// 0x003C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0040 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __OnPriviledgeChecked__Delegate;                  		// 0x004C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x0050 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __ServiceExecutionDelegate__Delegate;             		// 0x005C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData02[ 0x4 ];                             		// 0x0060 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3235 ];

		return pClassPointer;
	};

	void ServiceExecutionDelegate ( class UPsyNetClientService_X* Service );
	struct FIntVector3 ToIntVector3 ( struct FVector V );
	void OnPriviledgeChecked ( class UPrivilegeCheck_X* PrivilegeCheck );
	bool KeyPressDelegate ( );
};

UClass* U_Types_X::pClassPointer = NULL;

// Class ProjectX.ActorComponent_X
// 0x0007 (0x006C - 0x0065)
class UActorComponent_X : public UActorComponent
{
public:
	unsigned long                                      bTick : 1;                                        		// 0x0068 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bIgnoreScriptAttach : 1;                          		// 0x0068 (0x0004) [0x0000000000002002] [0x00000002] ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3237 ];

		return pClassPointer;
	};

	void Reattach ( );
	void eventTick ( float DeltaTime );
	void eventDetached ( );
	void eventAttached ( );
	void eventBeginPlay ( );
};

UClass* UActorComponent_X::pClassPointer = NULL;

// Class ProjectX.ExplosionComponent_X
// 0x0034 (0x00A0 - 0x006C)
class UExplosionComponent_X : public UActorComponent_X
{
public:
	class UDamageComponent_X*                          DamageComponent;                                  		// 0x006C (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              StartRadius;                                      		// 0x0070 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              EndRadius;                                        		// 0x0074 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Speed;                                            		// 0x0078 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Falloff;                                          		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bPassThroughWorldGeometry : 1;                    		// 0x0080 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bIgnoreInstigator : 1;                            		// 0x0080 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bDebug : 1;                                       		// 0x0080 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	struct FVector                                     MomentumOffset;                                   		// 0x0084 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              Lifetime;                                         		// 0x0090 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< class AActor* >                            DamagedActors;                                    		// 0x0094 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3239 ];

		return pClassPointer;
	};

	void eventProcessHit ( class AActor* Victim, struct FVector HitLocation, struct FTraceHitInfo ExtraHitInfo, float DamageScale );
	void eventDetached ( );
};

UClass* UExplosionComponent_X::pClassPointer = NULL;

// Class ProjectX.MICParamDispenserComponent_X
// 0x0014 (0x0080 - 0x006C)
class UMICParamDispenserComponent_X : public UActorComponent_X
{
public:
	struct FPointer                                    VfTable_IISetParameter;                           		// 0x006C (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	int                                                MaterialIndex;                                    		// 0x0070 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       AttachedComponentName;                            		// 0x0074 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UMeshComponent*                              MeshComp;                                         		// 0x007C (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3241 ];

		return pClassPointer;
	};

	bool __MICParamDispenserComponent_X__Attached ( struct FFXAttachment A );
	void eventAttached ( );
	void SetActorParameter ( struct FName Key, class AActor* Value );
	void SetLinearColorParameter ( struct FName Key, struct FLinearColor Value );
	void SetVectorParameter ( struct FName Key, struct FVector Value );
	void SetFloatParameter ( struct FName Key, float Value );
	void SetNameParameter ( struct FName Key, struct FName Value );
};

UClass* UMICParamDispenserComponent_X::pClassPointer = NULL;

// Class ProjectX.ShakeComponent_X
// 0x00D8 (0x0144 - 0x006C)
class UShakeComponent_X : public UActorComponent_X
{
public:
	float                                              InnerRadius;                                      		// 0x006C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              OuterRadius;                                      		// 0x0070 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Falloff;                                          		// 0x0074 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bAutoPlay : 1;                                    		// 0x0078 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bAutoDetach : 1;                                  		// 0x0078 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bOnlyAffectPlayersWithPawns : 1;                  		// 0x0078 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bAttenuate : 1;                                   		// 0x0078 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bPlaying : 1;                                     		// 0x0078 (0x0004) [0x0000000000002000] [0x00000010] ( CPF_Transient )
	unsigned long                                      bStopping : 1;                                    		// 0x0078 (0x0004) [0x0000000000002000] [0x00000020] ( CPF_Transient )
	unsigned char                                      Receiver;                                         		// 0x007C (0x0001) [0x0000000000000001]              ( CPF_Edit )
	float                                              RadiusScale;                                      		// 0x0080 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BlendInTime;                                      		// 0x0084 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BlendOutTime;                                     		// 0x0088 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UCameraShake*                                ShakeParams;                                      		// 0x008C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FRawDistributionFloat                       AmplitudeScale;                                   		// 0x0090 (0x001C) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	struct FRawDistributionFloat                       FrequencyScale;                                   		// 0x00AC (0x001C) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	struct FRawDistributionFloat                       DurationScale;                                    		// 0x00C8 (0x001C) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	float                                              CurrentAmplitudeScale;                            		// 0x00E4 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	float                                              CurrentFrequencyScale;                            		// 0x00E8 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	class UForceFeedbackWaveform*                      ForceFeedbackWaveform;                            		// 0x00EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ForceFeedbackScale;                               		// 0x00F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ForceFeedbackBalance;                             		// 0x00F4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FParticleSysParam >                 InstanceParameters;                               		// 0x00F8 (0x000C) [0x0000000004400001]              ( CPF_Edit | CPF_NeedCtorLink | CPF_EditInline )
	float                                              PlayTime;                                         		// 0x0104 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              StopTime;                                         		// 0x0108 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     ShakeLocTimeOffset;                               		// 0x010C (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     ShakeRotTimeOffset;                               		// 0x0118 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	float                                              ShakeFOVTimeOffset;                               		// 0x0124 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              CameraShakeDuration;                              		// 0x0128 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              ForceFeedbackDuration;                            		// 0x012C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              ForceFeedbackSamplesTime;                         		// 0x0130 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class AActor*                                      PrevOwner;                                        		// 0x0134 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FShakeReceiver >                    Receivers;                                        		// 0x0138 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3243 ];

		return pClassPointer;
	};

	bool GetColorParameter ( struct FName InName, struct FColor* OutColor );
	bool GetVectorParameter ( struct FName InName, struct FVector* OutVector );
	bool GetFloatParameter ( struct FName InName, float* OutFloat );
	void SetColorParameter ( struct FName ParameterName, struct FColor Param );
	void SetVectorRandParameter ( struct FName ParameterName, struct FVector* Param, struct FVector* ParamLow );
	void SetVectorParameter ( struct FName ParameterName, struct FVector Param );
	void SetFloatRandParameter ( struct FName ParameterName, float Param, float ParamLow );
	void SetFloatParameter ( struct FName ParameterName, float Param );
	bool IsPlaying ( );
	void eventStopShake ( float InBlendOutTime );
	void InitParams ( );
	void eventPlayShake ( );
	void eventDetached ( );
	void eventAttached ( );
};

UClass* UShakeComponent_X::pClassPointer = NULL;

// Class ProjectX.AdHocBeacon_X
// 0x0008 (0x0044 - 0x003C)
class UAdHocBeacon_X : public UObject
{
public:
	struct FPointer                                    VfTable_FTickableObject;                          		// 0x003C (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	struct FPointer                                    pAdHoc;                                           		// 0x0040 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3245 ];

		return pClassPointer;
	};

	int GetNodeCountMax ( );
	void AdHocJoinMatch ( );
	void AdHocCreateMatch ( );
	bool AdHocIsActive ( );
	void AdHocDisconnectFromAccessPoint ( );
	void AdHocConnectToAccessPoint ( int ScanResultIndex );
	void AdHocRevertToInitialized ( );
	void AdHocScanForAccessPoints ( );
	void AdHocBecomeStation ( );
	void AdHocRejectStation ( int NetworkNodeIndex );
	void AdHocBecomeAccessPoint ( );
	void AdHocSetAdvertiseData ( struct FString AdvertiseData );
	void AdHocDestroy ( );
	void AdHocCreate ( );
	void AdHocCreateWithUsername ( struct FString UserName );
	void eventConstruct ( );
};

UClass* UAdHocBeacon_X::pClassPointer = NULL;

// Class ProjectX.FXActor_X
// 0x005C (0x0258 - 0x01FC)
class AFXActor_X : public AActor
{
public:
	class UFXActorEvent_X*                             SpawnState;                                       		// 0x01FC (0x0004) [0x0000000000000000]              
	class UFXActorEvent_X*                             ActivationState;                                  		// 0x0200 (0x0004) [0x0000000000000000]              
	TArray< struct FFXAttachment >                     Attachments;                                      		// 0x0204 (0x000C) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	struct FName                                       SocketOrBoneName;                                 		// 0x0210 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bDeactivateWhenOwnerDestroyed : 1;                		// 0x0218 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bAllowShadowCasting : 1;                          		// 0x0218 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bActive : 1;                                      		// 0x0218 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      bPendingDestroy : 1;                              		// 0x0218 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	unsigned long                                      bHadOwner : 1;                                    		// 0x0218 (0x0004) [0x0000000000002002] [0x00000010] ( CPF_Const | CPF_Transient )
	class AFXActor_X*                                  Parent;                                           		// 0x021C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AActor*                                      AttachmentActor;                                  		// 0x0220 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< class UFXActorEvent_X* >                   FXStates;                                         		// 0x0224 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	class UParameterDispenser_X*                       Parameters;                                       		// 0x0230 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	int                                                EditID;                                           		// 0x0234 (0x0004) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	struct FScriptDelegate                             __EventFXStatePushed__Delegate;                   		// 0x0238 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x023C (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventFXStatePopped__Delegate;                   		// 0x0248 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x024C (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3247 ];

		return pClassPointer;
	};

	void eventDestroyed ( );
	void OnToggle ( class USeqAct_Toggle* Action );
	void OnTriggerFXActor_X ( class USeqAct_TriggerFXActor_X* SeqAct );
	void Inherit ( class AFXActor_X* Other );
	void CopyFrom ( class AFXActor_X* Other );
	void ResetParticles ( );
	void StopAllEffects ( );
	void eventDeactivateAndDestroy ( );
	void eventOnDetached ( class UActorComponent* AC );
	void eventDeactivateFXComponent ( class UActorComponent* AC );
	void eventActivateFXComponent ( class UActorComponent* AC );
	void eventOnAttached ( class UActorComponent* AC );
	void UpdateFXStates ( );
	bool IsLocallyControlled ( );
	class AController* GetControllerOwner ( );
	void ToggleState ( class UFXActorEvent_X* NewState );
	void RemoveState ( class UFXActorEvent_X* OldState );
	void AddState ( class UFXActorEvent_X* NewState );
	bool IsStateActive ( class UFXActorEvent_X* InState );
	void eventDeactivate ( );
	void eventActivate ( );
	void HandleParentStatePopped ( class AFXActor_X* P, class UFXActorEvent_X* Event );
	void HandleParentStatePushed ( class AFXActor_X* P, class UFXActorEvent_X* Event );
	void BindTo ( class AFXActor_X* ParentFXActor );
	void SetAttachmentActor ( class AActor* AttachToActor );
	void PostBeginPlay ( );
	void AllAttachments ( class UClass* ComponentClass, class UActorComponent** OutComponent, int* OutAttachmentIdx );
	class UActorComponent* GetComponentByName ( class UClass* ComponentClass, struct FName ComponentName );
	void EventFXStatePopped ( class AFXActor_X* FXActor, class UFXActorEvent_X* Event );
	void EventFXStatePushed ( class AFXActor_X* FXActor, class UFXActorEvent_X* Event );
};

UClass* AFXActor_X::pClassPointer = NULL;

// Class ProjectX.AnimateParametersComponent_X
// 0x0033 (0x0098 - 0x0065)
class UAnimateParametersComponent_X : public UActorComponent
{
public:
	TArray< struct FAnimatedFloatParam >               FloatParameters;                                  		// 0x0068 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FAnimatedVectorParam >              VectorParameters;                                 		// 0x0074 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FAnimatedLinearColorParam >         ColorParameters;                                  		// 0x0080 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bResetMaterialsOnComplete : 1;                    		// 0x008C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	float                                              AnimTime;                                         		// 0x0090 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              EndTime;                                          		// 0x0094 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3249 ];

		return pClassPointer;
	};

};

UClass* UAnimateParametersComponent_X::pClassPointer = NULL;

// Class ProjectX.ArchetypePrefab_X
// 0x0018 (0x0214 - 0x01FC)
class AArchetypePrefab_X : public AActor
{
public:
	TArray< class AActor* >                            PrefabArchetypes;                                 		// 0x01FC (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class AActor* >                            ArchetypeInstances;                               		// 0x0208 (0x000C) [0x0000000000402002]              ( CPF_Const | CPF_Transient | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3251 ];

		return pClassPointer;
	};

};

UClass* AArchetypePrefab_X::pClassPointer = NULL;

// Class ProjectX.ArchetypeSpawnPoint_X
// 0x0044 (0x0240 - 0x01FC)
class AArchetypeSpawnPoint_X : public AActor
{
public:
	struct FPointer                                    VfTable_IInterface_NavMeshPathObject;             		// 0x01FC (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	struct FString                                     ArchetypePath;                                    		// 0x0200 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	unsigned long                                      bSeedNavMesh : 1;                                 		// 0x020C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bSpawnOnLevelStart : 1;                           		// 0x020C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bOnlyAllowOneInstance : 1;                        		// 0x020C (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	class AActor*                                      ActorArchetype;                                   		// 0x0210 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USpriteComponent*                            PlacementSprite;                                  		// 0x0214 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USkeletalMeshComponent*                      ArchetypeSkeletalMesh;                            		// 0x0218 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UStaticMeshComponent*                        ArchetypeStaticMesh;                              		// 0x021C (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	TArray< class AActor* >                            SpawnedActors;                                    		// 0x0220 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	class AActor*                                      SpawnedActor;                                     		// 0x022C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FScriptDelegate                             __EventSpawned__Delegate;                         		// 0x0230 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0234 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3253 ];

		return pClassPointer;
	};

	void OnSpawned ( class AActor* Spawned );
	class AActor* DoSpawn ( );
	void OnToggle ( class USeqAct_Toggle* Action );
	void OnDestroy ( class USeqAct_Destroy* Action );
	void eventPostBeginPlay ( );
	void EventSpawned ( class AArchetypeSpawnPoint_X* SpawnPoint, class AActor* Spawned );
};

UClass* AArchetypeSpawnPoint_X::pClassPointer = NULL;

// Class ProjectX.Aws4Signature_X
// 0x0000 (0x003C - 0x003C)
class UAws4Signature_X : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3255 ];

		return pClassPointer;
	};

	void SignRequest ( class UHttpRequestInterface* HTTPRequest );
};

UClass* UAws4Signature_X::pClassPointer = NULL;

// Class ProjectX.TcpBeacon
// 0x004C (0x0094 - 0x0048)
class UTcpBeacon : public UComponent
{
public:
	struct FPointer                                    VfTable_FTickableObject;                          		// 0x0048 (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	int                                                MaxConnections;                                   		// 0x004C (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                ListenPort;                                       		// 0x0050 (0x0004) [0x0000000000004000]              ( CPF_Config )
	struct FString                                     ConnectionClassName;                              		// 0x0054 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	class UClass*                                      ConnectionClass;                                  		// 0x0060 (0x0004) [0x0000000000000000]              
	struct FPointer                                    ListenSocket;                                     		// 0x0064 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	TArray< class UTcpConnection* >                    Connections;                                      		// 0x0068 (0x000C) [0x0000000000402002]              ( CPF_Const | CPF_Transient | CPF_NeedCtorLink )
	struct FScriptDelegate                             __EventConnected__Delegate;                       		// 0x0074 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0078 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventDisconnected__Delegate;                    		// 0x0084 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x0088 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3257 ];

		return pClassPointer;
	};

	void ReceivedBunch ( class UTcpConnection* Connection );
	void OnDisconnected ( class UTcpConnection* Connection );
	void OnConnected ( class UTcpConnection* Connection );
	void eventOnConnectionRemoved ( class UTcpConnection* Connection );
	void eventOnConnectionAdded ( class UTcpConnection* Connection );
	class UTcpConnection* GetConnection ( struct FString Address );
	void Close ( );
	struct FString GetExternalHostAddress ( );
	struct FString GetLocalHostAddress ( );
	bool BeginListen ( );
	class UTcpConnection* BeginConnect ( struct FString Address );
	void EventDisconnected ( class UTcpBeacon* Beacon, class UTcpConnection* Connection );
	void EventConnected ( class UTcpBeacon* Beacon, class UTcpConnection* Connection );
};

UClass* UTcpBeacon::pClassPointer = NULL;

// Class ProjectX.TcpMessageBeacon
// 0x0020 (0x00B4 - 0x0094)
class UTcpMessageBeacon : public UTcpBeacon
{
public:
	class UOnlineMessageComponent_X*                   MessageComponent;                                 		// 0x0094 (0x0004) [0x000000000408000A]              ( CPF_Const | CPF_ExportObject | CPF_Component | CPF_EditInline )
	TArray< struct FTcpMessageHandler >                MessageHandlers;                                  		// 0x0098 (0x000C) [0x0000000000402002]              ( CPF_Const | CPF_Transient | CPF_NeedCtorLink )
	struct FScriptDelegate                             __MessageReceivedDelegate__Delegate;              		// 0x00A4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x00A8 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3259 ];

		return pClassPointer;
	};

	void BroadcastMessage ( class UObject* Message );
	void SendMessage ( class UTcpConnection* Connection, class UObject* Message );
	class UBeaconMessage_X* CreateMessage ( class UClass* MessageClass );
	void RemoveMessageHandler ( struct FScriptDelegate Callback );
	void AddMessageHandler ( class UClass* MessageClass, struct FScriptDelegate Callback );
	void MessageReceivedDelegate ( class UTcpConnection* Connection, class UObject* Message );
};

UClass* UTcpMessageBeacon::pClassPointer = NULL;

// Class ProjectX.BeaconMessage_X
// 0x0000 (0x003C - 0x003C)
class UBeaconMessage_X : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3261 ];

		return pClassPointer;
	};

	class UBeaconMessage_X* Broadcast ( );
	class UBeaconMessage_X* Send ( class UTcpConnection* Connection );
};

UClass* UBeaconMessage_X::pClassPointer = NULL;

// Class ProjectX.BugReport_X
// 0x00FC (0x0138 - 0x003C)
class UBugReport_X : public UObject
{
public:
	struct FPointer                                    VfTable_FTickableObject;                          		// 0x003C (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	struct FString                                     BugReportClassName;                               		// 0x0040 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	unsigned long                                      bEnableClientReports : 1;                         		// 0x004C (0x0004) [0x0000000000044001] [0x00000001] ( CPF_Edit | CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bEnableServerReports : 1;                         		// 0x004C (0x0004) [0x0000000000044001] [0x00000002] ( CPF_Edit | CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bUploadNextFile : 1;                              		// 0x004C (0x0004) [0x0000000000002002] [0x00000004] ( CPF_Const | CPF_Transient )
	unsigned long                                      bSubmitted : 1;                                   		// 0x004C (0x0004) [0x0000000000002002] [0x00000008] ( CPF_Const | CPF_Transient )
	struct FString                                     URL;                                              		// 0x0050 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                MaxFileSizeMetabytes;                             		// 0x005C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     BugID;                                            		// 0x0060 (0x000C) [0x0000000000402002]              ( CPF_Const | CPF_Transient | CPF_NeedCtorLink )
	struct FBugReportSubmitterData                     SubmitterData;                                    		// 0x006C (0x0028) [0x0000000000402002]              ( CPF_Const | CPF_Transient | CPF_NeedCtorLink )
	struct FBugReportSystemData                        SystemData;                                       		// 0x0094 (0x0028) [0x0000000000402002]              ( CPF_Const | CPF_Transient | CPF_NeedCtorLink )
	struct FBugReportPathData                          PathData;                                         		// 0x00BC (0x0030) [0x0000000000402002]              ( CPF_Const | CPF_Transient | CPF_NeedCtorLink )
	struct FBugReportDescriptionData                   DescriptionData;                                  		// 0x00EC (0x003C) [0x0000000000402002]              ( CPF_Const | CPF_Transient | CPF_NeedCtorLink )
	struct FPointer                                    LogFile;                                          		// 0x0128 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	TArray< struct FFileUploadData >                   FileUploads;                                      		// 0x012C (0x000C) [0x0000000000402002]              ( CPF_Const | CPF_Transient | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3263 ];

		return pClassPointer;
	};

	void HandleHttpRequestComplete ( class UHttpRequestInterface* OriginalRequest, class UHttpResponseInterface* InHttpResponse, unsigned long bDidSucceed );
	void LogText ( struct FString Str );
	void eventPDIReport ( );
	void CancelBugReport ( );
	void SubmitBugReport ( struct FString Title, struct FString Description, struct FString Email );
	void StartBugReport ( );
	void StaticSubmitBugReport ( struct FString Title );
	class UBugReport_X* CreateBugReport ( );
};

UClass* UBugReport_X::pClassPointer = NULL;

// Class ProjectX.CachedWebData_X
// 0x0028 (0x0064 - 0x003C)
class UCachedWebData_X : public UObject
{
public:
	TArray< unsigned char >                            Data;                                             		// 0x003C (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	int                                                DataCRC;                                          		// 0x0048 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FString                                     ETag;                                             		// 0x004C (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	class UError*                                      LoadError;                                        		// 0x0058 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UError*                                      DownloadError;                                    		// 0x005C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bNewData : 1;                                     		// 0x0060 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3265 ];

		return pClassPointer;
	};

	struct FString GetText ( );
	void UpdateData ( TArray< unsigned char > NewData, struct FString NewETag );
};

UClass* UCachedWebData_X::pClassPointer = NULL;

// Class ProjectX.Camera_X
// 0x00F4 (0x05CC - 0x04D8)
class ACamera_X : public ACamera
{
public:
	TArray< class UCameraState_X* >                    States;                                           		// 0x04D8 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FRotator                                    PCDeltaRotation;                                  		// 0x04E4 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FRotator                                    OldControllerRotation;                            		// 0x04F0 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     PCDeltaLocation;                                  		// 0x04FC (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     OldControllerLocation;                            		// 0x0508 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FCameraOrientation                          PreProcessPOV;                                    		// 0x0514 (0x002C) [0x0000000000002000]              ( CPF_Transient )
	struct FCameraOrientation                          PostProcessPOV;                                   		// 0x0540 (0x002C) [0x0000000000002000]              ( CPF_Transient )
	class UCameraStateBlender_X*                       Blender;                                          		// 0x056C (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FVector                                     ShakeLocationOffset;                              		// 0x0570 (0x000C) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	struct FRotator                                    ShakeRotationOffset;                              		// 0x057C (0x000C) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	float                                              ShakeFOVOffset;                                   		// 0x0588 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	struct FColor                                      StartFadeColor;                                   		// 0x058C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FColor                                      EndFadeColor;                                     		// 0x0590 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     ClipOffset;                                       		// 0x0594 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FLocationCameraKnock >              LocationKnocks;                                   		// 0x05A0 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< struct FRotationCameraKnock >              RotationKnocks;                                   		// 0x05AC (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned long                                      bDisableCameraShake : 1;                          		// 0x05B8 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bSnapNextTransition : 1;                          		// 0x05B8 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	struct FScriptDelegate                             __EventCameraStateChanged__Delegate;              		// 0x05BC (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x05C0 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3267 ];

		return pClassPointer;
	};

	void eventOnViewTargetChanged ( );
	void SetViewTarget ( class AActor* NewViewTarget, struct FViewTargetTransitionParams TransitionParams );
	bool IsTransitioning ( );
	void HandleBlenderStateChanged ( class UCameraStateBlender_X* CameraBlender );
	void SnapTransition ( );
	void PrintDebugInfo ( class UDebugDrawer* Drawer );
	void ApplyCameraModifiers ( float DeltaTime, struct FTPOV* OutPOV );
	bool CameraTrace ( struct FVector End, struct FVector Start, struct FVector Extent, struct FVector* HitLoc, class AActor** HitActor );
	class UCameraState_X* InstanceCameraState ( class UCameraState_X* Archetype );
	void eventModifyPostProcessSettings ( struct FPostProcessSettings* PP );
	void ProcessViewRotation ( float DeltaTime, struct FRotator* OutViewRotation, struct FRotator* OutDeltaRot );
	void PostProcessCameraState ( float DeltaTime, struct FCameraOrientation* OutPOV );
	void ProcessCameraState ( float DeltaTime, struct FCameraOrientation* OutPOV );
	void CheckViewTarget ( struct FTViewTarget* VT );
	void CopyFade ( class ACamera_X* Other );
	void SetCameraFade ( unsigned long bNewEnableFading, struct FColor NewFadeColor, struct FVector2D NewFadeAlpha, float NewFadeTime, unsigned long bNewFadeAudio );
	void UpdateFade ( float DeltaTime );
	void eventUpdateCamera ( float DeltaTime );
	void ClampPOV ( struct FCameraOrientation* OutPOV );
	struct FRotator RemoveRoll ( struct FRotator InRot );
	class UCameraState_X* GetCameraState ( );
	class UCameraState_X* SelectCameraState ( );
	void UpdateCameraState ( );
	void UpdateCameraKnocks ( float DeltaTime, struct FCameraOrientation* OutPOV );
	void AddRotationKnock ( struct FRotationCameraKnock Knock, float Scale );
	void AddLocationKnock ( struct FLocationCameraKnock Knock, float Scale, struct FRotator Transform );
	void InstanceCameraStates ( );
	void InitializeFor ( class APlayerController* PC );
	void ModifyCameraShakeScale ( class UCameraShake* Shake, float NewScale );
	void OnLoadingMovieClosesd ( );
	void eventPostBeginPlay ( );
	struct FVector InterpVector ( struct FVector OldValue, struct FVector NewValue, struct FVectorInterpRate Rate, struct FRotator Orientation, float DeltaTime );
	void FinalizeOrientation ( struct FCameraOrientation* OutPOV );
	struct FCameraOrientation BlendCameraOrientations ( float Alpha, struct FCameraOrientation* A, struct FCameraOrientation* B );
	void EventCameraStateChanged ( class ACamera_X* Camera, class UCameraState_X* CameraState );
};

UClass* ACamera_X::pClassPointer = NULL;

// Class ProjectX.CameraAttachmentComponent_X
// 0x0013 (0x0078 - 0x0065)
class UCameraAttachmentComponent_X : public UActorComponent
{
public:
	TArray< class UActorComponent* >                   Attachments;                                      		// 0x0068 (0x000C) [0x0000000004480009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_NeedCtorLink | CPF_EditInline )
	unsigned long                                      bDirtyTransform : 1;                              		// 0x0074 (0x0004) [0x0000000000002002] [0x00000001] ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3269 ];

		return pClassPointer;
	};

};

UClass* UCameraAttachmentComponent_X::pClassPointer = NULL;

// Class ProjectX.CanvasTexture_X
// 0x0010 (0x013C - 0x012C)
class UCanvasTexture_X : public UTextureRenderTarget2D
{
public:
	struct FScriptDelegate                             __Draw__Delegate;                                 		// 0x012C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0130 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3271 ];

		return pClassPointer;
	};

	void Draw ( class UCanvas* C );
};

UClass* UCanvasTexture_X::pClassPointer = NULL;

// Class ProjectX.CanvasTextureComponent_X
// 0x0017 (0x007C - 0x0065)
class UCanvasTextureComponent_X : public UActorComponent
{
public:
	class UMeshComponent*                              Mesh;                                             		// 0x0068 (0x0004) [0x000000000408000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_Component | CPF_EditInline )
	int                                                MaterialIndex;                                    		// 0x006C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       MaterialParamName;                                		// 0x0070 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UCanvasTexture_X*                            Texture;                                          		// 0x0078 (0x0004) [0x000000000440000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3273 ];

		return pClassPointer;
	};

	void OnDraw ( class UCanvas* C );
};

UClass* UCanvasTextureComponent_X::pClassPointer = NULL;

// Class ProjectX.PlayerController_X
// 0x007C (0x063C - 0x05C0)
class APlayerController_X : public APlayerController
{
public:
	class ACamera*                                     CameraArchetype;                                  		// 0x05C0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AHUD*                                        HUDArchetype;                                     		// 0x05C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class APawn*                                       OldPawnReference;                                 		// 0x05C8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class AActor*                                      LockedDebugActor;                                 		// 0x05CC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class APlayerReplicationInfo*                      LastPRI;                                          		// 0x05D0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bPausedForExternalUI : 1;                         		// 0x05D4 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	class UNetConnection*                              NetConnection;                                    		// 0x05D8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FScriptDelegate                             __EventReceivedPRI__Delegate;                     		// 0x05DC (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x05E0 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventPawnChange__Delegate;                      		// 0x05EC (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x05F0 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventReceivedPlayer__Delegate;                  		// 0x05FC (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData02[ 0x4 ];                             		// 0x0600 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventDestroyed__Delegate;                       		// 0x060C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData03[ 0x4 ];                             		// 0x0610 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventPlayerCameraChange__Delegate;              		// 0x061C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData04[ 0x4 ];                             		// 0x0620 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventPlayerKicked__Delegate;                    		// 0x062C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData05[ 0x4 ];                             		// 0x0630 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3275 ];

		return pClassPointer;
	};

	void ClientSetSeasonReward ( struct FPlayerSeasonRewardProgress Reward );
	void ServerUpdateCustomMatchSettings ( struct FCustomMatchSettings Settings );
	void ServerSetParty ( struct FUniqueNetId MemberId, struct FUniqueNetId NewPartyID );
	void DisconnectSplitScreenPlayer ( class UPlayer* P );
	void ServerDestroy ( );
	void KickPlayerForReason ( struct FString Reason, struct FString Title );
	void ClientNetLag ( float PktLag, float PktVariance, float PktLoss, float PktDup );
	void ServerNetLag ( float PktLag, float PktVariance, float PktLoss, float PktDup );
	void Pause ( );
	void RemoveOptionFromLastURL ( struct FString OptName );
	void PrintDebugInfo ( class UDebugDrawer* Drawer );
	void eventClearOnlineDelegates ( );
	void RegisterOnlineDelegates ( );
	void NotifyTakeHit_X ( class UDamageComponent_X* Damage );
	void eventClientPlayForceFeedbackWaveform ( class UForceFeedbackWaveform* FFWaveform, class AActor* FFWaveformInstigator );
	void ClientCommand ( struct FString Command );
	void ServerCommand ( struct FString Command );
	void PawnDied ( class APawn* P );
	void eventUnPossess ( );
	void eventPossess ( class APawn* aPawn, unsigned long bVehicleTransition );
	void OnPawnChange ( class APawn* OldPawn, class APawn* NewPawn );
	void PawnReferenceUpdated ( );
	void ClientRestart ( class APawn* NewPawn );
	void GivePawn ( class APawn* NewPawn );
	void eventInitInputSystem ( );
	class ACamera* GetCameraArchetype ( );
	void eventSpawnPlayerCamera ( );
	void OnCameraChanged ( class ACamera* InCamera );
	void AddCheats ( unsigned long bForce );
	class UOnlineGameAccount_X* GetOnlineAccount ( );
	class UOnlinePlayer_X* GetOnlinePlayer ( );
	void OnReceivedPRI ( );
	void InitPlayerReplicationInfo ( );
	void eventDestroyed ( );
	void OnExternalUIChanged ( unsigned long bIsOpening );
	void SetPaused ( unsigned long bPaused );
	void eventReceivedPlayer ( );
	class UOnlineGame_X* GetOnlineGame ( );
	class UIOnlineGameHost_X* GetOnlineGameHost ( );
	class UOnlineGameLanServer_X* GetOnlineGameLanServer ( );
	class UOnlineGameDedicatedServer_X* GetOnlineGameDedicatedServer ( );
	void SpawnDefaultHUD ( );
	void SetPRI ( class APlayerReplicationInfo* PRI );
	void eventReplicatedEvent ( struct FName VarName );
	void EventPlayerKicked ( class APlayerController_X* PC, struct FString Reason );
	void EventPlayerCameraChange ( class APlayerController_X* PC );
	void EventDestroyed ( class APlayerController_X* PC );
	void EventReceivedPlayer ( class APlayerController_X* PC );
	void EventPawnChange ( class APlayerController_X* PC, class APawn* OldPawn, class APawn* NewPawn );
	void EventReceivedPRI ( class APlayerController_X* PC );
};

UClass* APlayerController_X::pClassPointer = NULL;

// Class ProjectX.CheatManager_X
// 0x0010 (0x0064 - 0x0054)
class UCheatManager_X : public UCheatManager
{
public:
	struct FScriptDelegate                             __EventDelegateTest__Delegate;                    		// 0x0054 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0058 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3277 ];

		return pClassPointer;
	};

	void LoadPsynetStaticData ( struct FString Environment, struct FString Platform, struct FString Language );
	void HandleImageDownloaded ( class UOnlineImageDownloaderWeb_X* Downloader, struct FDownloadedImage Image );
	void DownloadImage ( struct FString URL );
	void LoadKismetLevel ( struct FName LeveFileName );
	void DrawBulletContacts ( float Lifetime );
	void PrintReproPhysics ( struct FString Command, class AActor* A );
	void ReproPhysics ( class AActor* A, float LX, float LY, float LZ, float RX, float RY, float RZ, float RW, float VX, float VY, float VZ );
	void DisableCCD ( );
	void SimulateInputKey ( struct FName KeyName );
	void SetNetServerMaxTickRate ( float Rate );
	void ScreenShotDir ( struct FString Directory );
	void ListVisiblePrimitives ( );
	void HideVisiblePrimitives ( struct FString NameMatch, struct FString NameIgnore );
	void ToggleReplicateVoiceToSelf ( );
	void ToggleReplicateVoiceToSender ( );
	void EventDelegateTest ( );
};

UClass* UCheatManager_X::pClassPointer = NULL;

// Class ProjectX.CheatObject_X
// 0x0000 (0x003C - 0x003C)
class UCheatObject_X : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3279 ];

		return pClassPointer;
	};

};

UClass* UCheatObject_X::pClassPointer = NULL;

// Class ProjectX.Compression_X
// 0x0000 (0x003C - 0x003C)
class UCompression_X : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3281 ];

		return pClassPointer;
	};

	bool Uncompress ( TArray< unsigned char >* Compressed, TArray< unsigned char >* Uncompressed );
	bool Compress ( TArray< unsigned char >* Uncompressed, TArray< unsigned char >* Compressed );
};

