/*
#############################################################################################
# RocketLeague (1.0.10897.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TAGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_MaxAirControlSensitivity                           10.f
#define CONST_MaxSteeringSensitivity                             10.f
#define CONST_UnrealUnitsPerMeter                                100
#define CONST_TRADEHOLD_NONE                                     0
#define CONST_TRADEHOLD_ALL                                      -1
#define CONST_TRADEHOLD_P2P                                      -2
#define CONST_MaxFriendKeyLength                                 64
#define CONST_MAX_REPLICATED_VOTERS                              8

	SES_Active                                         = 1,
	SES_Redemption                                     = 2,
	SES_MAX                                            = 3
};*/

// Enum TAGame.GFxData_TourEvent_TA.ETourEventStatus
/*enum ETourEventStatus
{
	TES_NonePending                                    = 0,
	TES_Registered                                     = 1,
	TES_CheckInOpen                                    = 2,
	TES_CheckedIn                                      = 3,
	TES_GeneratingBrackets                             = 4,
	TES_MatchPending                                   = 5,
	TES_MatchReady                                     = 6,
	TES_InMatch                                        = 7,
	TES_MatchResultsPending                            = 8,
	TES_Paused                                         = 9,
	TES_MAX                                            = 10
};*/

// Enum TAGame.GFxData_TrainingModeBrowser_TA.ETrainingModeSearchTypes
/*enum ETrainingModeSearchTypes
{
	TMST_AllPublic                                     = 0,
	TMST_FeaturedOnly                                  = 1,
	TMST_MAX                                           = 2
};*/

// Enum TAGame.GFxData_UnlockNotification_TA.EUnlockType
/*enum EUnlockType
{
	UnlockType_AchievementUnlocked                     = 0,
	UnlockType_ChallengeActive                         = 1,
	UnlockType_ChallengeUnlocked                       = 2,
	UnlockType_MAX                                     = 3
};*/

// Enum TAGame.SeqAct_CheckRotationAngle_TA.ECheckAxis
/*enum ECheckAxis
{
	ECA_Pitch                                          = 0,
	ECA_Yaw                                            = 1,
	ECA_Roll                                           = 2,
	ECA_MAX                                            = 3
};*/

// Enum TAGame.StaticMeshRBActor_TA.EApplyForceTo
/*enum EApplyForceTo
{
	EAF_None                                           = 0,
	EAF_Any                                            = 1,
	EAF_CarOnly                                        = 2,
	EAF_BallOnly                                       = 3,
	EAF_MAX                                            = 4
};*/

// Enum TAGame.TMetricsShared_TA.EDisconnect
/*enum EDisconnect
{
	EDisconnect_Timeout                                = 0,
	EDisconnect_Kick                                   = 1,
	EDisconnect_GameFull                               = 2,
	EDisconnect_MAX                                    = 3
};*/

// Enum TAGame.TMetricsShared_TA.EMatchType
/*enum EMatchType
{
	EmatchType_Online                                  = 0,
	EMatchType_Private                                 = 1,
	EMatchType_Offline                                 = 2,
	EMatchType_MAX                                     = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class TAGame._AITypes_TA
// 0x0000 (0x003C - 0x003C)
class U_AITypes_TA : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3521 ];

		return pClassPointer;
	};

};

UClass* U_AITypes_TA::pClassPointer = NULL;

// Class TAGame._Types_TA
// 0x0030 (0x006C - 0x003C)
class U_Types_TA : public UObject
{
public:
	struct FScriptDelegate                             __AssetLoadedDelegate__Delegate;                  		// 0x003C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0040 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __ProductThumbnailRenderedDelegate__Delegate;     		// 0x004C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x0050 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __MapImageLoadedDelegate__Delegate;               		// 0x005C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData02[ 0x4 ];                             		// 0x0060 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3523 ];

		return pClassPointer;
	};

	struct FLoadoutTeamPaint GetLoadoutPaint ( struct FLoadoutData InLoadoutData );
	int GetRandomColorID ( class UCarColorSet_TA* Set );
	void InitColorSet ( class UCarColorSet_TA* Set, TArray< struct FGFxTeamColor >* OutColors );
	struct FString ProductQualityToString ( unsigned char Quality );
	bool TeamPaintsAreDifferent ( struct FLoadoutData* A, struct FLoadoutData* B );
	bool OnlineProductsAreDifferent ( );
	bool ProductsAreDifferent ( TArray< int >* A, TArray< int >* B );
	bool LoadoutsAreDifferent ( struct FLoadoutData* A, struct FLoadoutData* B );
	float UpdateInputValue ( struct FInputRate Rate, float DesiredValue, float OldValue, float DeltaTime );
	struct FClientLoadoutData ConvertToClientLoadout ( struct FLoadoutData* FromData );
	void MapImageLoadedDelegate ( struct FMapImageLoadResult Result );
	void ProductThumbnailRenderedDelegate ( struct FProductThumbnailResult Result );
	void AssetLoadedDelegate ( struct FAssetLoadResult Result );
	struct FRandomWeight PickWeightedRandom ( TArray< struct FRandomWeight > Arr, int* Index );
	bool VehicleInputHasChangedForKick ( struct FVehicleInputs* NewInput, struct FVehicleInputs* OldInput );
};

UClass* U_Types_TA::pClassPointer = NULL;

// Class TAGame.AIController_TA
// 0x01C8 (0x0574 - 0x03AC)
class AAIController_TA : public AAIController
{
public:
	class ACar_TA*                                     Car;                                              		// 0x03AC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class AVehicle_TA*                                 Vehicle;                                          		// 0x03B0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UBTComponent*                                BT;                                               		// 0x03B4 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBTProxyType*                                SelfProxyType;                                    		// 0x03B8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                NoneProxyType;                                    		// 0x03BC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                DebugProxyType;                                   		// 0x03C0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                TeamCarsProxyType;                                		// 0x03C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                EnemyCarsProxyType;                               		// 0x03C8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                OtherCarsProxyType;                               		// 0x03CC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                BoostPillsProxyType;                              		// 0x03D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                SelectedProxyType;                                		// 0x03D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   SelfTarget;                                       		// 0x03D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   NoneTarget;                                       		// 0x03DC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   IteratorTarget;                                   		// 0x03E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   TeamCarsTarget;                                   		// 0x03E4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   SelectedTarget;                                   		// 0x03E8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   ContextTarget;                                    		// 0x03EC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UBTNode*                                     DebugBTNode;                                      		// 0x03F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTLockCollection*                           Locks;                                            		// 0x03F4 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FSkillRange                                 SkillSteerError;                                  		// 0x03F8 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FSkillRange                                 SkillSteerSpeed;                                  		// 0x0404 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FSkillRange                                 SkillThrottleSpeed;                               		// 0x0410 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class AGameEvent_TA*                               GameEvent;                                        		// 0x041C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class AAIManager_TA*                               AIManager;                                        		// 0x0420 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FNamedEvent >                       QueuedEvents;                                     		// 0x0424 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FVehicleInputs                              Input;                                            		// 0x0430 (0x0020) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     ForwardDir;                                       		// 0x0450 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FRotator                                    ForwardRotation;                                  		// 0x045C (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     GroundNormal;                                     		// 0x0468 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FCachedProxyData >                  CachedProxyDatas;                                 		// 0x0474 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< struct FCachedTargetData >                 CachedTargetDatas;                                		// 0x0480 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FMap_Mirror                                 TargetFilterMap;                                  		// 0x048C (0x003C) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	TArray< class UBTNode* >                           CachedTargetFilters;                              		// 0x04C8 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FVector                                     DebugDriveDestination;                            		// 0x04D4 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FCachedObstaclesData                        CachedObstacles;                                  		// 0x04E0 (0x0024) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	struct FAITraits                                   Traits;                                           		// 0x0504 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	TArray< class ACar_TA* >                           TeamCars;                                         		// 0x050C (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< class ACar_TA* >                           EnemyCars;                                        		// 0x0518 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< class ACar_TA* >                           OtherCars;                                        		// 0x0524 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned long                                      bForceUpdateConditions : 1;                       		// 0x0530 (0x0004) [0x0000000000002002] [0x00000001] ( CPF_Const | CPF_Transient )
	unsigned long                                      bCanUseBoost : 1;                                 		// 0x0530 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      bBeingReplaced : 1;                               		// 0x0530 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	class UAIRole_TA*                                  TestRole;                                         		// 0x0534 (0x0004) [0x0000000000000000]              
	class UGameShare_TA*                               GameShare;                                        		// 0x0538 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class AActor*                                      SelectedActor;                                    		// 0x053C (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	float                                              FieldScalar;                                      		// 0x0540 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FScriptDelegate                             __EventNamedEvent__Delegate;                      		// 0x0544 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0548 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventSkillChanged__Delegate;                    		// 0x0554 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x0558 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventTraitsChanged__Delegate;                   		// 0x0564 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData02[ 0x4 ];                             		// 0x0568 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3525 ];

		return pClassPointer;
	};

	void PrintDebugInfo ( class UDebugDrawer* Drawer );
	void SetSelectedActor ( class AActor* NewActor );
	void AllTargets ( class UBTTarget* Target, struct FBTProxyData* OutData );
	bool GetObstacleInRadius ( struct FVector Destination, float Radius, struct FVector* HitLocation );
	bool GetObstacle ( struct FVector Destination, struct FVector* HitLocation );
	bool eventGetProxyDataInternal ( class UBTProxyType* Type, int Index, struct FBTProxyData* OutData );
	bool GetIndexedProxyData ( class UBTProxyType* Type, int Index, struct FBTProxyData* OutData );
	bool GetProxyData ( class UBTProxyType* Type, struct FBTProxyData* OutData );
	bool GetIndexedTargetData ( class UBTTarget* Target, int Index, struct FBTProxyData* OutData );
	bool GetTargetData ( class UBTTarget* Target, struct FBTProxyData* OutData );
	struct FBTProxyData eventCreateVehicleProxyData ( class AVehicle_TA* InVehicle );
	struct FBTProxyData eventCreateProxyData ( class AActor* A, float Radius );
	float GetDriveTime ( float Distance );
	float GetDriveDistance ( struct FBTProxyData Proxy );
	struct FVector FlattenOffset ( struct FVector Offset, float* Height );
	struct FVector FlattenDestination ( struct FVector Destination );
	struct FBTProxyData FlattenPhysics ( struct FBTProxyData* ProxyData );
	float GetClosestTime2D ( float MaxTime, struct FBTProxyData* A, struct FBTProxyData* B );
	bool WillImpact2D ( struct FBTProxyData* A, struct FBTProxyData* B, float* CollideTime );
	void AdvancePhysics ( float Time, struct FBTProxyData* PhysicsData );
	void PredictPhysics ( float Time, float GroundZ, struct FBTProxyData* PhysicsData );
	void PredictLanding ( float GroundZ, struct FBTProxyData* Data, float* Time );
	struct FVector AdvanceLocation ( float Time, struct FVector* Loc, struct FVector* Vel, struct FVector* Accel );
	void DebugDriveTo ( struct FVector Destination );
	void DoNothing ( );
	void AbortBT ( );
	void eventOnNamedEvent ( struct FName EventName, class AActor* Sender );
	void eventDestroyed ( );
	void OnCarSetup ( class ACar_TA* InCar );
	void SetCar ( );
	void UnPossess ( );
	void Possess ( class APawn* inPawn, unsigned long bVehicleTransition );
	void SetSkill ( float NewSkill );
	void ReInitBT ( );
	void SetTraits ( struct FAITraits InTraits );
	void HandleOtherCarDestroyed ( class APawn_X* InCar );
	void HandleOtherCarDemolished ( class ACar_TA* Victim, struct FDemolishData Data );
	void HandleOtherCarTeamChanged ( class ACar_TA* InCar );
	void HandleCarSpawned ( class AGameEvent_TA* InGameEvent, class ACar_TA* InCar );
	void Init ( class AGameEvent_TA* InGameEvent );
	void eventPreBeginPlay ( );
	void EventTraitsChanged ( class AAIController_TA* AI );
	void EventSkillChanged ( class AAIController_TA* AI );
	void EventNamedEvent ( class AAIController_TA* AI, struct FName EventName, class AActor* Sender );
};

UClass* AAIController_TA::pClassPointer = NULL;

// Class TAGame.AIController_Soccar_TA
// 0x0068 (0x05DC - 0x0574)
class AAIController_Soccar_TA : public AAIController_TA
{
public:
	class UBTProxyType*                                BallProxyType;                                    		// 0x0574 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                BallLandingProxyType;                             		// 0x0578 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                BallTeamGoalLineProxyType;                        		// 0x057C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                BallEnemyGoalLineProxyType;                       		// 0x0580 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                BallProjectedProxyType;                           		// 0x0584 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                TeamGoalProxyType;                                		// 0x0588 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                EnemyGoalProxyType;                               		// 0x058C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                MidFieldProxyType;                                		// 0x0590 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   BallTarget;                                       		// 0x0594 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   TeamGoalTarget;                                   		// 0x0598 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   EnemyGoalTarget;                                  		// 0x059C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AGameEvent_Soccar_TA*                        SoccarGame;                                       		// 0x05A0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class ABall_TA*                                    Ball;                                             		// 0x05A4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FAICachedGoalInfo                           TeamGoalInfo;                                     		// 0x05A8 (0x0010) [0x0000000000082000]              ( CPF_Transient | CPF_Component )
	struct FAICachedGoalInfo                           EnemyGoalInfo;                                    		// 0x05B8 (0x0010) [0x0000000000082000]              ( CPF_Transient | CPF_Component )
	float                                              LastBallHitTime;                                  		// 0x05C8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FScriptDelegate                             __EventBallChanged__Delegate;                     		// 0x05CC (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x05D0 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3527 ];

		return pClassPointer;
	};

	bool eventGetProxyDataInternal ( class UBTProxyType* Type, int Index, struct FBTProxyData* OutData );
	void GetGoalProxy ( class UBTProxyType* Type, struct FAICachedGoalInfo GoalInfo, struct FBTProxyData* OutData );
	void GetBallProxy ( struct FBTProxyData* OutData );
	void SetBall ( class ABall_TA* InBall );
	void HandleNewPickup ( class ACar_TA* InCar, class ASpecialPickup_TA* NewPickup );
	void HandleHitBall ( class ACar_TA* InCar, class ABall_TA* HitBall );
	void OnCarSetup ( class ACar_TA* InCar );
	void UpdateBall ( );
	void HandleActiveRoundChanged ( class AGameEvent_Soccar_TA* G );
	void HandleBallsChanged ( class AGameEvent_Soccar_TA* G, class ABall_TA* B );
	struct FAICachedGoalInfo GetCachedGoalInfo ( int TeamNum );
	void Init ( class AGameEvent_TA* InGameEvent );
	void EventBallChanged ( class AAIController_Soccar_TA* SoccarAI );
};

UClass* AAIController_Soccar_TA::pClassPointer = NULL;

// Class TAGame.AIManager_TA
// 0x0028 (0x0238 - 0x0210)
class AAIManager_TA : public AActor
{
public:
	unsigned long                                      bFlushAILogEachLine : 1;                          		// 0x0210 (0x0004) [0x0000000000004003] [0x00000001] ( CPF_Edit | CPF_Const | CPF_Config )
	unsigned long                                      bOutputLogToWindow : 1;                           		// 0x0210 (0x0004) [0x0000000000004003] [0x00000002] ( CPF_Edit | CPF_Const | CPF_Config )
	unsigned long                                      bPauseForDirtyTrees : 1;                          		// 0x0210 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	class UBTLockCollection*                           Locks;                                            		// 0x0214 (0x0004) [0x000000000408000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class AGameEvent_TA*                               GameEvent;                                        		// 0x0218 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< class AAIController_TA* >                  Bots;                                             		// 0x021C (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< struct FCachedNavMeshLocation >            CachedNavMeshLocations;                           		// 0x0228 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	class AFileLog*                                    AILogFile;                                        		// 0x0234 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3529 ];

		return pClassPointer;
	};

	void eventDestroyed ( );
	void RemoveBot ( class AAIController_TA* Bot );
	void AddBot ( class AAIController_TA* Bot );
	void Init ( class AGameEvent_TA* InGameEvent );
	void eventAILog ( class UObject* Sender, struct FString Message, unsigned long bVerbose );
};

UClass* AAIManager_TA::pClassPointer = NULL;

// Class TAGame.AnimNodeBlend_TA
// 0x000F (0x0100 - 0x00F1)
class UAnimNodeBlend_TA : public UAnimNodeBlendBase
{
public:
	float                                              BlendSpeed;                                       		// 0x00F4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Position;                                         		// 0x00F8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              DesiredPosition;                                  		// 0x00FC (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3531 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeBlend_TA::pClassPointer = NULL;

// Class TAGame.AnimNodeBlendBoost_TA
// 0x0004 (0x0108 - 0x0104)
class UAnimNodeBlendBoost_TA : public UAnimNodeBlend
{
public:
	float                                              BlendTime;                                        		// 0x0104 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3533 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeBlendBoost_TA::pClassPointer = NULL;

// Class TAGame.AnimNodeBlendSpeed_TA
// 0x0008 (0x0144 - 0x013C)
class UAnimNodeBlendSpeed_TA : public UAnimNodeAimOffset
{
public:
	float                                              BlendRate;                                        		// 0x013C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MaxSpeed;                                         		// 0x0140 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3535 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeBlendSpeed_TA::pClassPointer = NULL;

// Class TAGame.ArenaSoundSettings_TA
// 0x00A0 (0x00DC - 0x003C)
class UArenaSoundSettings_TA : public UObject
{
public:
	class UAkSoundCue*                                 InGameMusicCue;                                   		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bDynamicMusic : 1;                                		// 0x0040 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      UpdateStatSounds : 1;                             		// 0x0040 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	class UAkSoundCue*                                 GoalScoreSound;                                   		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 GameStartStinger;                                 		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 GoalScoreStinger;                                 		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 EpicSaveStinger;                                  		// 0x0050 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 OvertimeStinger;                                  		// 0x0054 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 WinStinger;                                       		// 0x0058 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 LoseStinger;                                      		// 0x005C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              GoalScoreStingerDelay;                            		// 0x0060 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 Win;                                              		// 0x0064 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 Lose;                                             		// 0x0068 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 CountdownStart;                                   		// 0x006C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 CountdownEnd;                                     		// 0x0070 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 OneMinRemaining;                                  		// 0x0074 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 ThirtySecondsRemaining;                           		// 0x0078 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 OvertimeStart;                                    		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FArenaStatSound >                   StatSounds;                                       		// 0x0080 (0x000C) [0x0000000000400041]              ( CPF_Edit | CPF_EditConstArray | CPF_NeedCtorLink )
	TArray< class UAkSoundCue* >                       CountDownSoundList;                               		// 0x008C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class UAkSoundCue* >                       RoundCountDownSoundList;                          		// 0x0098 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FAkEnvironment                              GoalStingerEnvironment;                           		// 0x00A4 (0x001C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FAkEnvironment                              LevelDefaultEnvironment;                          		// 0x00C0 (0x001C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3537 ];

		return pClassPointer;
	};

};

UClass* UArenaSoundSettings_TA::pClassPointer = NULL;

// Class TAGame.AssetProfiler_TA
// 0x008C (0x029C - 0x0210)
class AAssetProfiler_TA : public AActor
{
public:
	float                                              TimePerAsset;                                     		// 0x0210 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              TimeBetweenAssets;                                		// 0x0214 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UProductSlot_TA* >                   Slots;                                            		// 0x0218 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FRenderProfile                              CurrentProfile;                                   		// 0x0224 (0x0024) [0x0000000000002000]              ( CPF_Transient )
	struct FRenderProfile                              NoneAssetProfile;                                 		// 0x0248 (0x0024) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FAssetProfile >                     AssetProfiles;                                    		// 0x026C (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                CurrentProductID;                                 		// 0x0278 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UProductAsset_TA*                            CurrentProduct;                                   		// 0x027C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UProductDatabase_TA*                         ProductsDB;                                       		// 0x0280 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< class ACarPreviewActor_TA* >               Cars;                                             		// 0x0284 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FString                                     AssetNameToProfile;                               		// 0x0290 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3539 ];

		return pClassPointer;
	};

	void RecordAssetFrameTimesToCSV ( );
	void Finish ( );
	void StopRecording ( );
	void StartRecording ( );
	void StartNextAsset ( );
	void StopRecordingNoneAsset ( );
	void StartRecordingNoneAsset ( );
	void StartProfiling ( );
	void EquipProduct ( class UProductAsset_TA* Asset );
	class UProductAsset_TA* EquipProductID ( int ProductID );
	bool ShouldProfileProduct ( class UProductAsset_TA* Product );
	void PrintAsset ( struct FString AssetName, float AssetTime );
	void UpdateProfileTimes ( struct FRenderProfile* Profile );
	void GatherCars ( );
	void DisableVSync ( );
	void SetupPlayers ( );
	void FilterProducts ( struct FString InCommand, TArray< class UProductSlot_TA* >* FilterLocal_4ED057B44BB0DD53F50F2CBA1040E92C );
	void eventPostBeginPlay ( );
};

UClass* AAssetProfiler_TA::pClassPointer = NULL;

// Class TAGame.AttachmentBehavior_TA
// 0x000C (0x0048 - 0x003C)
class UAttachmentBehavior_TA : public UObject
{
public:
	class UProductAsset_TA*                            Asset;                                            		// 0x003C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UActorComponent*                             Component;                                        		// 0x0040 (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	unsigned long                                      bPreview : 1;                                     		// 0x0044 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3541 ];

		return pClassPointer;
	};

	class UCarMeshComponent_TA* GetMesh ( );
	void SetPreviewing ( unsigned long bPreviewing );
	void OnInit ( );
	void Init ( class UProductAsset_TA* InAsset, class UActorComponent* InComponent );
};

UClass* UAttachmentBehavior_TA::pClassPointer = NULL;

// Class TAGame.RimSpinner_TA
// 0x0030 (0x0078 - 0x0048)
class URimSpinner_TA : public UAttachmentBehavior_TA
{
public:
	float                                              AccelRate;                                        		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DecelRate;                                        		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MaxSpeed;                                         		// 0x0050 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       BoneControlName;                                  		// 0x0054 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              SpinScale;                                        		// 0x005C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                WheelIndex;                                       		// 0x0060 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              CurrentSpeed;                                     		// 0x0064 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                CurrentRotation;                                  		// 0x0068 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class USkelControlSingleBone*                      SpinBoneController;                               		// 0x006C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class USkelControlSingleBone*                      WheelBoneController;                              		// 0x0070 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UWheel_TA*                                   Wheel;                                            		// 0x0074 (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3543 ];

		return pClassPointer;
	};

	void HandleAttached ( class UCarMeshComponent_TA* Mesh );
	void OnInit ( );
};

UClass* URimSpinner_TA::pClassPointer = NULL;

// Class TAGame.PlayerControllerBase_TA
// 0x005C (0x0694 - 0x0638)
class APlayerControllerBase_TA : public APlayerController_X
{
public:
	float                                              SpectatorCameraAccel;                             		// 0x0638 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     SpectatorVelXY;                                   		// 0x063C (0x000C) [0x0000000000002000]              ( CPF_Transient )
	float                                              SpectatorVelZ;                                    		// 0x0648 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UPostProcessManager_TA*                      PostProcessManagerArchetype;                      		// 0x064C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UPostProcessManager_TA*                      PostProcessManager;                               		// 0x0650 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                SpectatorPitchDir;                                		// 0x0654 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                SwivelPitchDir;                                   		// 0x0658 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class ASpectatorVolume_TA*                         SpectatorVolume;                                  		// 0x065C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UPlayerBanner_TA*                            PlayerBanner;                                     		// 0x0660 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FScriptDelegate                             __EventLoadingUnfairMatch__Delegate;              		// 0x0664 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0668 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventRemoveSSPlayer__Delegate;                  		// 0x0674 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x0678 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventReceivedCurrencyDrop__Delegate;            		// 0x0684 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData02[ 0x4 ];                             		// 0x0688 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3545 ];

		return pClassPointer;
	};

	struct FVector UpdateSpectatorLocation ( struct FVector CurrentLocation, float DeltaTime, unsigned long bAlwaysClamp );
	void PrintDebugInfo ( class UDebugDrawer* Drawer );
	void ReceiveCurrencyDrop ( struct FCurrencyDrop Drop );
	bool FindSpectatorVolumeLocation ( struct FVector CurrentLocation, struct FVector NextLocation, struct FVector* NewLocation );
	struct FVector ClampSpectatorLocation ( struct FVector NewLocation );
	void SetWorldSelectionUpdate ( unsigned long bAllowUpdate );
	void SetWorldSelectionAllowed ( unsigned long bAllowSelection );
	void SetPlayerInput ( class UClass* NewInputClass );
	void StartLanMatch ( struct FCustomMatchSettings* Settings );
	struct FString BuildMatchOptionsLan ( struct FCustomMatchSettings* Settings, TArray< struct FString >* ArrayInitializer_7ADCDE6B40DF9DBE1EAD60821243B784 );
	void StartSplitscreenMatch ( struct FCustomMatchSettings* Settings, TArray< struct FString >* ArrayInitializer_F2594D7A4D4F54C148DC1C83DD9C1CD7 );
	void StartMatch ( struct FName PlaylistName, struct FString URL );
	struct FString BuildMatchOptions ( class UGameSettingPlaylist_X* Playlist, TArray< struct FString > Options, struct FCustomMatchSettings* Settings, struct FString* ReduceLocal_3C81843B48EB4F62420EF8B80A0633F0 );
	struct FString JoinOption ( struct FString FullString, struct FString Value );
	struct FName GetValidMapName ( struct FName InName, int GameMode );
	void ClientRemoveSSPlayer ( struct FString Reason, struct FString Title );
	void RemoveSSPlayer ( struct FString Reason, struct FString Title );
	void OnGameInviteAccepted ( struct FString ErrorString, struct FOnlineGameSearchResult* InviteResult );
	void UpdateSpectatorViewRotation ( float DeltaTime );
	struct FRotator GetSpectatorViewRotationDeltaRotation ( float DeltaTime );
	void EraseChatByType ( unsigned char ChatChannel, struct FUniqueNetId PersonaId );
	bool PartyLobbyMessage_TA ( struct FUniqueNetId InSenderId, struct FString PlayerName, struct FString Message, unsigned long bIsLocalPlayer );
	void Say_TA ( struct FString Message, unsigned char ChatChannel, struct FUniqueNetId Recipient, unsigned long bPreset );
	void ServerSay_TA ( struct FString Message, unsigned char ChatChannel, unsigned long bPreset );
	void RepopulateChatHistory ( unsigned char ChatChannel, struct FUniqueNetId PersonaId );
	bool InviteHasEnoughSpace ( class UOnlineGameSettings* InviteSettings );
	bool ShouldEnableForceFeedback ( );
	class UObject* GetProfileObject ( class UClass* saveClass );
	class UObject* GetSaveObject ( class UClass* saveClass );
	class USaveData_TA* GetSaveData ( );
	class UProfile_TA* GetProfile ( );
	class ULocalPlayer_TA* GetLocalPlayer ( );
	void InitProfileSettings ( unsigned long bJustReceivedPlayer );
	void eventDestroyed ( );
	void eventReceivedPlayer ( );
	void eventPostBeginPlay ( );
	void EventReceivedCurrencyDrop ( class APlayerControllerBase_TA* PC, struct FCurrencyDrop Drop );
	void EventRemoveSSPlayer ( class APlayerControllerBase_TA* PC, struct FString Reason );
	void EventLoadingUnfairMatch ( class APlayerControllerBase_TA* PlayerControllerBase );
};

UClass* APlayerControllerBase_TA::pClassPointer = NULL;

// Class TAGame.PlayerController_TA
// 0x0270 (0x0904 - 0x0694)
class APlayerController_TA : public APlayerControllerBase_TA
{
public:
	struct FClientData                                 Client;                                           		// 0x0694 (0x0040) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned long                                      bAdjustingSimTime : 1;                            		// 0x06D4 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bReceivedPlayerAndPRI : 1;                        		// 0x06D4 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      bReceivedServerShutdownMessage : 1;               		// 0x06D4 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      bPendingIdleKick : 1;                             		// 0x06D4 (0x0004) [0x0000000000002020] [0x00000008] ( CPF_Net | CPF_Transient )
	unsigned long                                      bUseDebugInputs : 1;                              		// 0x06D4 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bJumpPressed : 1;                                 		// 0x06D4 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bBoostPressed : 1;                                		// 0x06D4 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bHandbrakePressed : 1;                            		// 0x06D4 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      bHasPitchedBack : 1;                              		// 0x06D4 (0x0004) [0x0000000000000000] [0x00000100] 
	float                                              TimeClientAckdAdjustSimTime;                      		// 0x06D8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                ReplicatedInputBufferSize;                        		// 0x06DC (0x0004) [0x0000000000002020]              ( CPF_Net | CPF_Transient )
	struct FClientStatsData                            ClientStats;                                      		// 0x06E0 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	class ACar_TA*                                     Car;                                              		// 0x06EC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class APRI_TA*                                     PRI;                                              		// 0x06F0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FVehicleInputs                              VehicleInput;                                     		// 0x06F4 (0x0020) [0x0000000000002000]              ( CPF_Transient )
	struct FString                                     LoginURL;                                         		// 0x0714 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned char                                      VoiceFilter;                                      		// 0x0720 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	unsigned char                                      ChatFilter;                                       		// 0x0721 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	struct FChatSpamData                               ChatSpam;                                         		// 0x0724 (0x0018) [0x0000000000000001]              ( CPF_Edit )
	struct FChatBanData                                ChatBan;                                          		// 0x073C (0x0020) [0x0000000000000000]              
	class ULightBarComponent_TA*                       LightBar;                                         		// 0x075C (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UGameMusicComponent_TA*                      MusicComponent;                                   		// 0x0760 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UListenerLocationComponent_TA*               ListenerLocationComponent;                        		// 0x0764 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UAudioPriorityComponent_TA*                  AudioPriorityComponent;                           		// 0x0768 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class APRI_TA*                                     FollowTarget;                                     		// 0x076C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UOnlineGameTrial_X*                          Trial;                                            		// 0x0770 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class ACamera*                                     SpectatorCameraArchetype;                         		// 0x0774 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AHUD*                                        SpectatorHUDArchetype;                            		// 0x0778 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      SpectatorInputClass;                              		// 0x077C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class ACamera*                                     EditorCameraArchetype;                            		// 0x0780 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AHUD*                                        EditorHUDArchetype;                               		// 0x0784 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      EditorInputClass;                                 		// 0x0788 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UInterface_GameEditor_TA*                    MoveActor;                                        		// 0x078C (0x0008) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0790 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FVector                                     MoveActorGrabOffset;                              		// 0x0794 (0x000C) [0x0000000000000000]              
	float                                              MoveActorGrabIncrement;                           		// 0x07A0 (0x0004) [0x0000000000000000]              
	float                                              MinMoveActorGrabDistance;                         		// 0x07A4 (0x0004) [0x0000000000000000]              
	float                                              MouseIncrementSpeed;                              		// 0x07A8 (0x0004) [0x0000000000000000]              
	float                                              BallVelocityIncrementAmount;                      		// 0x07AC (0x0004) [0x0000000000000000]              
	int                                                BallVelocityIncrementFireCount;                   		// 0x07B0 (0x0004) [0x0000000000000000]              
	float                                              BallVelocityIncrementFireCountMax;                		// 0x07B4 (0x0004) [0x0000000000000000]              
	float                                              BallVelocityIncrementSpeedDefault;                		// 0x07B8 (0x0004) [0x0000000000000000]              
	float                                              BallVelocityIncrementSpeedMax;                    		// 0x07BC (0x0004) [0x0000000000000000]              
	float                                              CrosshairTraceDistance;                           		// 0x07C0 (0x0004) [0x0000000000000000]              
	class AActor*                                      TracedCrosshairActor;                             		// 0x07C4 (0x0004) [0x0000000000000000]              
	TArray< struct FCrosshairExtentInfo >              CrosshairTraceExtents;                            		// 0x07C8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UInterface_GameEditor_TA*                    RotatedActor;                                     		// 0x07D4 (0x0008) [0x0000000000000000]              
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x07D8 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FVector                                     RotateActorCameraLocationOffset;                  		// 0x07DC (0x000C) [0x0000000000000000]              
	struct FVector                                     RotateActorCameraRotationOffset;                  		// 0x07E8 (0x000C) [0x0000000000000000]              
	int                                                RotateActorCameraSide;                            		// 0x07F4 (0x0004) [0x0000000000000000]              
	float                                              DesiredCameraSide;                                		// 0x07F8 (0x0004) [0x0000000000000000]              
	float                                              PawnTypeChangedTime;                              		// 0x07FC (0x0004) [0x0000000000000000]              
	int                                                SelectedSpawnArchetype;                           		// 0x0800 (0x0004) [0x0000000000000000]              
	struct FVehicleInputs                              DebugInputs;                                      		// 0x0804 (0x0020) [0x0000000000002000]              ( CPF_Transient )
	int                                                MinClientInputRate;                               		// 0x0824 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	int                                                MedianClientInputRate;                            		// 0x0828 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	int                                                MaxClientInputRate;                               		// 0x082C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	int                                                ConfiguredClientInputRate;                        		// 0x0830 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              TimeSinceLastMovePacket;                          		// 0x0834 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              TimeLastReplicatedMovePacket;                     		// 0x0838 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UPlatformMetrics_TA*                         PlatformMetrics;                                  		// 0x083C (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	float                                              MouseXDeadZone;                                   		// 0x0840 (0x0004) [0x0000000000000000]              
	float                                              MouseYDeadZone;                                   		// 0x0844 (0x0004) [0x0000000000000000]              
	float                                              MouseXDeadZoneAir;                                		// 0x0848 (0x0004) [0x0000000000000000]              
	float                                              MouseYDeadZoneAir;                                		// 0x084C (0x0004) [0x0000000000000000]              
	struct FVehicleInputs                              LastInputs;                                       		// 0x0850 (0x0020) [0x0000000000000000]              
	class APRI_TA*                                     PendingViewPRI;                                   		// 0x0870 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UNetworkJitterSettings_TA*                   JitterSettings;                                   		// 0x0874 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UClientConnectionTracker_TA*                 ConnectionTracker;                                		// 0x0878 (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	class UProfileCameraSave_TA*                       CameraSave;                                       		// 0x087C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UProfileGamepadSave_TA*                      GamepadSave;                                      		// 0x0880 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class APlayerController_TA*                        PrimaryPlayerController;                          		// 0x0884 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UEngineShare_TA*                             EngineShare;                                      		// 0x0888 (0x0004) [0x0000000000000000]              
	class UNetworkConfig_TA*                           NetworkConfig;                                    		// 0x088C (0x0004) [0x0000000000000000]              
	class UPhysicsConfig_X*                            PhysicsConfig;                                    		// 0x0890 (0x0004) [0x0000000000000000]              
	struct FScriptDelegate                             __EventLaunchAccountPicker__Delegate;             		// 0x0894 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData02[ 0x4 ];                             		// 0x0898 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventLaunchControllerApplet__Delegate;          		// 0x08A4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData03[ 0x4 ];                             		// 0x08A8 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventPendingIdleKickChanged__Delegate;          		// 0x08B4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
