/*
#############################################################################################
# RocketLeague (1.0.10897.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TAGame_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct TAGame._AITypes_TA.BTDynamicLinkData
// 0x000C
struct FBTDynamicLinkData
{
	struct FName                                       LinkName;                                         		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UBTNode*                                     Node;                                             		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TAGame._AITypes_TA.AITraits
// 0x0007
struct FAITraits
{
	class UAIRole_TA*                                  Role;                                             		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Aggression;                                       		// 0x0004 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Hostility;                                        		// 0x0005 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Airplay;                                          		// 0x0006 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TAGame._AITypes_TA.NamedEvent
// 0x0010
struct FNamedEvent
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	class AActor*                                      Sender;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              RadiusSq;                                         		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._AITypes_TA.BTProxyData
// 0x0040
struct FBTProxyData
{
	struct FVector                                     Location;                                         		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FVector                                     Velocity;                                         		// 0x000C (0x000C) [0x0000000000000000]              
	struct FVector                                     Gravity;                                          		// 0x0018 (0x000C) [0x0000000000000000]              
	struct FRotator                                    Rotation;                                         		// 0x0024 (0x000C) [0x0000000000000000]              
	float                                              Radius;                                           		// 0x0030 (0x0004) [0x0000000000000000]              
	float                                              Bounce;                                           		// 0x0034 (0x0004) [0x0000000000000000]              
	class AActor*                                      Actor;                                            		// 0x0038 (0x0004) [0x0000000000000000]              
	class AVehicle_TA*                                 Vehicle;                                          		// 0x003C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._AITypes_TA.AICachedGoalInfo
// 0x0010
struct FAICachedGoalInfo
{
	class UGoal_TA*                                    Goal;                                             		// 0x0000 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FVector                                     FieldSize;                                        		// 0x0004 (0x000C) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.SimilarLogoGroup
// 0x000C
struct FSimilarLogoGroup
{
	TArray< class UProductAsset_Logo_TA* >             SimilarLogoColorAssets;                           		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.GameModeData
// 0x0010
struct FGameModeData
{
	int                                                GameMode;                                         		// 0x0000 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	struct FString                                     LocalizedName;                                    		// 0x0004 (0x000C) [0x0000000040400000]              ( CPF_NeedCtorLink | CPF_EditInlineNotify )
};

// ScriptStruct TAGame._Types_TA.PlayerChatMessage
// 0x0060
struct FPlayerChatMessage
{
	float                                              MessageTimeStamp;                                 		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FUniqueNetId                                PlayerID;                                         		// 0x0004 (0x0048) [0x0000000000000000]              
	unsigned char                                      ChatChannel;                                      		// 0x004C (0x0001) [0x0000000000000000]              
	int                                                Team;                                             		// 0x0050 (0x0004) [0x0000000000000000]              
	struct FString                                     Message;                                          		// 0x0054 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.ReportPlayerData
// 0x0054
struct FReportPlayerData
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000000000]              
	struct FString                                     PlayerName;                                       		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.ReportedPlayerInfo
// 0x00B8
struct FReportedPlayerInfo
{
	struct FReportPlayerData                           Reporter;                                         		// 0x0000 (0x0054) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FReportPlayerData                           Offender;                                         		// 0x0054 (0x0054) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Reason;                                           		// 0x00A8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              ReportTimeStamp;                                  		// 0x00B4 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.AssetLoadResult
// 0x0010
struct FAssetLoadResult
{
	int                                                ProductID;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FName                                       AssetName;                                        		// 0x0004 (0x0008) [0x0000000000000000]              
	class UProductAsset_TA*                            Asset;                                            		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutData
// 0x000C
struct FClientLoadoutData
{
	TArray< int >                                      Products;                                         		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.LoadoutTeamColor
// 0x0008
struct FLoadoutTeamColor
{
	unsigned char                                      Team;                                             		// 0x0000 (0x0001) [0x0000000000000000]              
	unsigned char                                      TeamColorID;                                      		// 0x0001 (0x0001) [0x0000000000000000]              
	unsigned char                                      CustomColorID;                                    		// 0x0002 (0x0001) [0x0000000000000000]              
	unsigned long                                      bSet : 1;                                         		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TAGame._Types_TA.LoadoutTeamPaint
// 0x0008(0x0010 - 0x0008)
struct FLoadoutTeamPaint : FLoadoutTeamColor
{
	int                                                TeamFinishID;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                CustomFinishID;                                   		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.LoadoutData
// 0x0028(0x0034 - 0x000C)
struct FLoadoutData : FClientLoadoutData
{
	struct FLoadoutTeamPaint                           TeamPaint;                                        		// 0x000C (0x0010) [0x0000000000000000]              
	struct FName                                       Title;                                            		// 0x001C (0x0008) [0x0000000000000000]              
	int                                                TeamIndex;                                        		// 0x0024 (0x0004) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0xC ];                             		// 0x0028 (0x000C) UNKNOWN PROPERTY: ArrayProperty TAGame._Types_TA.LoadoutData.OnlineProducts
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutOnlineProduct
// 0x000C
struct FClientLoadoutOnlineProduct
{
	TArray< class UProductAttribute_TA* >              Attributes;                                       		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutOnlineData
// 0x000C
struct FClientLoadoutOnlineData
{
	TArray< struct FClientLoadoutOnlineProduct >       Products;                                         		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.InputRate
// 0x0008
struct FInputRate
{
	float                                              RiseRate;                                         		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FallRate;                                         		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TAGame._Types_TA.CycleButtonItem
// 0x0018
struct FCycleButtonItem
{
	struct FString                                     Label;                                            		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     Value;                                            		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.GFxTeamColor
// 0x0010
struct FGFxTeamColor
{
	int                                                Value;                                            		// 0x0000 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	int                                                ColorID;                                          		// 0x0004 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	int                                                X;                                                		// 0x0008 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	int                                                Y;                                                		// 0x000C (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
};

// ScriptStruct TAGame._Types_TA.MapGroup
// 0x000C
struct FMapGroup
{
	TArray< class UMapData_TA* >                       Maps;                                             		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.MapImageLoadResult
// 0x000C
struct FMapImageLoadResult
{
	class UTexture2D*                                  Image;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FName                                       MapName;                                          		// 0x0004 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.ProductThumbnailResult
// 0x000C
struct FProductThumbnailResult
{
	class UProductAsset_TA*                            Asset;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	class UOnlineProduct_TA*                           OnlineProduct;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	class UProductThumbnail_TA*                        Thumbnail;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.RandomWeight
// 0x000C
struct FRandomWeight
{
	class UObject*                                     Obj;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              Weight;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              OrigWeight;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.WeldingInfo
// 0x0020
struct FWeldingInfo
{
	class ARBActor_TA*                                 RBActor;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FVector                                     Offset;                                           		// 0x0004 (0x000C) [0x0000000000000000]              
	float                                              Mass;                                             		// 0x0010 (0x0004) [0x0000000000000000]              
	struct FRotator                                    Rotation;                                         		// 0x0014 (0x000C) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.VehicleInputs
// 0x0020
struct FVehicleInputs
{
	float                                              Throttle;                                         		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Steer;                                            		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Pitch;                                            		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Yaw;                                              		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Roll;                                             		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DodgeForward;                                     		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DodgeStrafe;                                      		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bJump : 1;                                        		// 0x001C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bActivateBoost : 1;                               		// 0x001C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bHoldingBoost : 1;                                		// 0x001C (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bHandbrake : 1;                                   		// 0x001C (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bJumped : 1;                                      		// 0x001C (0x0004) [0x0000000000000000] [0x00000010] 
};

// ScriptStruct TAGame._Types_TA.ProductAttributesArray
// 0x000C
struct FProductAttributesArray
{
	TArray< class UProductAttribute_TA* >              Attributes;                                       		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.LoadoutAttributesArray
// 0x000C
struct FLoadoutAttributesArray
{
	TArray< struct FProductAttributesArray >           Products;                                         		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.CurrencyDrop
// 0x0008
struct FCurrencyDrop
{
	int                                                CurrencyID;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                Amount;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.RPCIntroCar
// 0x0028
struct FRPCIntroCar
{
	int                                                TemplateIndex;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     TemplateName;                                     		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     TemplateDescription;                              		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      ProductsList;                                     		// 0x001C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.IntroCarInfo
// 0x001C
struct FIntroCarInfo
{
	int                                                TemplateIndex;                                    		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     TemplateName;                                     		// 0x0004 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     TemplateDescription;                              		// 0x0010 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.EditorIntroCar
// 0x0028
struct FEditorIntroCar
{
	struct FIntroCarInfo                               Info;                                             		// 0x0000 (0x001C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class UProduct_TA* >                       ProductList;                                      		// 0x001C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.XPUnlockableFeature
// 0x0014
struct FXPUnlockableFeature
{
	struct FString                                     Name;                                             		// 0x0000 (0x000C) [0x0000000040400000]              ( CPF_NeedCtorLink | CPF_EditInlineNotify )
	unsigned long                                      bUnlocked : 1;                                    		// 0x000C (0x0004) [0x0000000040000000] [0x00000001] ( CPF_EditInlineNotify )
	int                                                XPLevelUnlocked;                                  		// 0x0010 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
};

// ScriptStruct TAGame._Types_TA.GarageComplexRow
// 0x0008
struct FGarageComplexRow
{
	int                                                RowID;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                ProductID;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.GarageComplexLoadout
// 0x001C
struct FGarageComplexLoadout
{
	struct FLoadoutTeamPaint                           TeamPaint;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0xC ];                             		// 0x0010 (0x000C) UNKNOWN PROPERTY: ArrayProperty TAGame._Types_TA.GarageComplexLoadout.OnlineProducts
};

// ScriptStruct TAGame._Types_TA.GarageComplexSlot
// 0x0044
struct FGarageComplexSlot
{
	int                                                SlotID;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned long                                      bUnlocked : 1;                                    		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                TeamIndex;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FGarageComplexLoadout                       SlotLoadouts[ 0x2 ];                              		// 0x000C (0x0038) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.AppliedBreakoutDamage
// 0x0018
struct FAppliedBreakoutDamage
{
	unsigned char                                      Id;                                               		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FVector                                     Location;                                         		// 0x0004 (0x000C) [0x0000000000000000]              
	int                                                DamageIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                TotalDamage;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.PaintAttributeParameter
// 0x0010
struct FPaintAttributeParameter
{
	unsigned char                                      PaintVariant;                                     		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ParameterName;                                    		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bEnabled : 1;                                     		// 0x000C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct TAGame._Types_TA.ProductLevelData
// 0x0010
struct FProductLevelData
{
	int                                                Level;                                            		// 0x0000 (0x0004) [0x0000000040000001]              ( CPF_Edit | CPF_EditInlineNotify )
	int                                                SoftCurrency;                                     		// 0x0004 (0x0004) [0x0000000040000001]              ( CPF_Edit | CPF_EditInlineNotify )
	int                                                HardCurrency;                                     		// 0x0008 (0x0004) [0x0000000040000001]              ( CPF_Edit | CPF_EditInlineNotify )
	float                                              UnlockWeight;                                     		// 0x000C (0x0004) [0x0000000040000001]              ( CPF_Edit | CPF_EditInlineNotify )
};

// ScriptStruct TAGame._Types_TA.BallPredictionInfo
// 0x003C
struct FBallPredictionInfo
{
	float                                              Time;                                             		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              ArchTopTime;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FVector                                     Location;                                         		// 0x0008 (0x000C) [0x0000000000000000]              
	struct FVector                                     Velocity;                                         		// 0x0014 (0x000C) [0x0000000000000000]              
	struct FVector                                     ArchTop;                                          		// 0x0020 (0x000C) [0x0000000000000000]              
	struct FVector                                     ArchTopVelocity;                                  		// 0x002C (0x000C) [0x0000000000000000]              
	unsigned long                                      bHitWall : 1;                                     		// 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bHitGround : 1;                                   		// 0x0038 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct TAGame._Types_TA.AimAssistSettings
// 0x0034
struct FAimAssistSettings
{
	unsigned long                                      bOverride : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              ControlAlpha;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              MinSteerDot;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              MaxSteerDot;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              MinVelocity;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              MaxVelocity;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              MinPlayerInputDrive;                              		// 0x0018 (0x0004) [0x0000000000000000]              
	float                                              MinDistanceToBallXY;                              		// 0x001C (0x0004) [0x0000000000000000]              
	float                                              MaxDistanceToBallXY;                              		// 0x0020 (0x0004) [0x0000000000000000]              
	float                                              MinDistanceToBallZ;                               		// 0x0024 (0x0004) [0x0000000000000000]              
	float                                              MaxDistanceToBallZ;                               		// 0x0028 (0x0004) [0x0000000000000000]              
	float                                              MinDotAngleFromBall;                              		// 0x002C (0x0004) [0x0000000000000000]              
	float                                              MaxDotAngleFromBall;                              		// 0x0030 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.OnlineProductAttribute
// 0x0014
struct FOnlineProductAttribute
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FString                                     Value;                                            		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.OnlineProductData
// 0x0020
struct FOnlineProductData
{
	int                                                ProductID;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x0004 (0x0008) UNKNOWN PROPERTY: QWordProperty TAGame._Types_TA.OnlineProductData.InstanceID
	int                                                SeriesID;                                         		// 0x000C (0x0004) [0x0000000000000000]              
	TArray< struct FOnlineProductAttribute >           Attributes;                                       		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                TradeHold;                                        		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.OnlinePlayerMatchData
// 0x0064
struct FOnlinePlayerMatchData
{
	class APRI_TA*                                     PRI;                                              		// 0x0000 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FUniqueNetId                                PlayerID;                                         		// 0x0004 (0x0048) [0x0000000000000000]              
	int                                                GameSecondsPlayed;                                		// 0x004C (0x0004) [0x0000000000000000]              
	int                                                GameScore;                                        		// 0x0050 (0x0004) [0x0000000000000000]              
	TArray< struct FOnlineProductData >                Loadout;                                          		// 0x0054 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bCompletedMatch : 1;                              		// 0x0060 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TAGame._Types_TA.ActorHistory
// 0x0018
struct U_Types_TA_FActorHistory
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	unsigned char                                      Type;                                             		// 0x0008 (0x0001) [0x0000000000000000]              
	struct FString                                     SerializedHistory;                                		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.SortedProductData
// 0x0020
struct FSortedProductData
{
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x0000 (0x0008) UNKNOWN PROPERTY: QWordProperty TAGame._Types_TA.SortedProductData.Id
	unsigned long                                      bUnlocked : 1;                                    		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     Name;                                             		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bIsPack : 1;                                      		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                SortPriority;                                     		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.EditorRoundData
// 0x0010
struct FEditorRoundData
{
	float                                              TimeLimit;                                        		// 0x0000 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	TArray< struct FString >                           SerializedArchetypes;                             		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.LoadObjectResult
// 0x0009
struct FLoadObjectResult
{
	class UObject*                                     ObjectData;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	class UError*                                      Error;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      Code;                                             		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.SaveObjectResult
// 0x0009
struct FSaveObjectResult
{
	class UObject*                                     ObjectData;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	class UError*                                      Error;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      Code;                                             		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.MaterialTextureParam
// 0x000C
struct FMaterialTextureParam
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UTexture*                                    Value;                                            		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TAGame._Types_TA.MaterialVectorParam
// 0x0018
struct FMaterialVectorParam
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Value;                                            		// 0x0008 (0x0010) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TAGame._Types_TA.MaterialScalarParam
// 0x000C
struct FMaterialScalarParam
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              Value;                                            		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TAGame._Types_TA.MaterialParams
// 0x0024
struct FMaterialParams
{
	TArray< struct FMaterialTextureParam >             TextureParameters;                                		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FMaterialVectorParam >              VectorParameters;                                 		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FMaterialScalarParam >              ScalarParameters;                                 		// 0x0018 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.ProductSkinOverride
// 0x000C
struct FProductSkinOverride
{
	struct FName                                       SkinName;                                         		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UMaterialInterface*                          Material;                                         		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TAGame._Types_TA.UniqueNetIdGroup4
// 0x0120
struct FUniqueNetIdGroup4
{
	struct FUniqueNetId                                PlayerIDs[ 0x4 ];                                 		// 0x0000 (0x0120) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.UIProductSlotData
// 0x000C
struct FUIProductSlotData
{
	class UProductSlot_TA*                             Slot;                                             		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  Texture;                                          		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkSoundCue*                                 Sound;                                            		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TAGame._Types_TA.SimpleSpringSettings
// 0x0050
struct FSimpleSpringSettings
{
	struct FVector                                     Strength;                                         		// 0x0000 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     Damping;                                          		// 0x000C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     MaxDisplacement;                                  		// 0x0018 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bUseMinDisplacement : 1;                          		// 0x0024 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	struct FVector                                     MinDisplacement;                                  		// 0x0028 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              Mass;                                             		// 0x0034 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     MassOffset;                                       		// 0x0038 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              MaxSpeed;                                         		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bDebug : 1;                                       		// 0x0048 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	float                                              DrawDebugOffset;                                  		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TAGame._Types_TA.WheelContactData
// 0x0044
struct FWheelContactData
{
	unsigned long                                      bHasContact : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bHasContactWithWorldGeometry : 1;                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	float                                              HasContactChangeTime;                             		// 0x0004 (0x0004) [0x0000000000000000]              
	class AActor*                                      Actor;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
	class UPrimitiveComponent*                         Component;                                        		// 0x000C (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FVector                                     Location;                                         		// 0x0010 (0x000C) [0x0000000000000000]              
	struct FVector                                     Normal;                                           		// 0x001C (0x000C) [0x0000000000000000]              
	struct FVector                                     LatDirection;                                     		// 0x0028 (0x000C) [0x0000000000000000]              
	struct FVector                                     LongDirection;                                    		// 0x0034 (0x000C) [0x0000000000000000]              
	class UPhysicalMaterialProperty_TA*                PhysMatProp;                                      		// 0x0040 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.WheelAttachment
// 0x0018
struct FWheelAttachment
{
	class UPrimitiveComponent*                         Component;                                        		// 0x0000 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	TArray< class UAttachmentBehavior_TA* >            Behaviors;                                        		// 0x0004 (0x000C) [0x0000000004400001]              ( CPF_Edit | CPF_NeedCtorLink | CPF_EditInline )
	struct FName                                       Socket;                                           		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TAGame._Types_TA.ProductAttachment
// 0x0048
struct FProductAttachment
{
	class UStaticMesh*                                 StaticMesh;                                       		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USkeletalMesh*                               SkeletalMesh;                                     		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UParticleSystem*                             ParticleSystem;                                   		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UMaterialInterface*                          Material;                                         		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Scale;                                            		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     Translation;                                      		// 0x0014 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    Rotation;                                         		// 0x0020 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Socket;                                           		// 0x002C (0x0001) [0x0000000000000001]              ( CPF_Edit )
	class UAntennaComponent_TA*                        Antenna;                                          		// 0x0030 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	TArray< class UAttachmentBehavior_TA* >            Behaviors;                                        		// 0x0034 (0x000C) [0x0000000004400001]              ( CPF_Edit | CPF_NeedCtorLink | CPF_EditInline )
	class UPrimitiveComponent*                         Component;                                        		// 0x0040 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class AFXActor_X*                                  FXActor;                                          		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TAGame._Types_TA.AccumulatedRigidBodyCollision
// 0x0074
struct FAccumulatedRigidBodyCollision
{
	class AActor*                                      Actor;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	class UPrimitiveComponent*                         Component;                                        		// 0x0004 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UPhysicalMaterial*                           PhysMat;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FVector                                     Velocity;                                         		// 0x000C (0x000C) [0x0000000000000000]              
	struct FVector                                     OtherVelocity;                                    		// 0x0018 (0x000C) [0x0000000000000000]              
	struct FVector                                     Location;                                         		// 0x0024 (0x000C) [0x0000000000000000]              
	struct FVector                                     Normal;                                           		// 0x0030 (0x000C) [0x0000000000000000]              
	struct FVector                                     NormalForce;                                      		// 0x003C (0x000C) [0x0000000000000000]              
	struct FVector                                     FrictionForce;                                    		// 0x0048 (0x000C) [0x0000000000000000]              
	struct FVector                                     NormalVelocity;                                   		// 0x0054 (0x000C) [0x0000000000000000]              
	struct FVector                                     FrictionVelocity;                                 		// 0x0060 (0x000C) [0x0000000000000000]              
	int                                                NumCollisions;                                    		// 0x006C (0x0004) [0x0000000000000000]              
	int                                                NumContacts;                                      		// 0x0070 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.StatValue
// 0x0014
struct FStatValue
{
	struct FName                                       Id;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                Values[ 0x3 ];                                    		// 0x0008 (0x000C) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.TAPlayerStat
// 0x0008
struct FTAPlayerStat
{
	class UStatEvent_TA*                               StatEvent;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                Count;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.BallHitInfo
// 0x00E1
struct FBallHitInfo
{
	class APRI_TA*                                     PRI;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
	class APRI_TA*                                     AttackerPRI;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FName                                       CarName;                                          		// 0x0008 (0x0008) [0x0000000000000000]              
	int                                                TeamNum;                                          		// 0x0010 (0x0004) [0x0000000000000000]              
	struct FReplicatedRBState                          PreHitCarPhysics;                                 		// 0x0014 (0x0038) [0x0000000000000000]              
	struct FReplicatedRBState                          PreHitBallPhysics;                                		// 0x004C (0x0038) [0x0000000000000000]              
	struct FReplicatedRBState                          PostHitBallPhysics;                               		// 0x0084 (0x0038) [0x0000000000000000]              
	float                                              Distance;                                         		// 0x00BC (0x0004) [0x0000000000000000]              
	float                                              Time;                                             		// 0x00C0 (0x0004) [0x0000000000000000]              
	struct FVector                                     HitLocation;                                      		// 0x00C4 (0x000C) [0x0000000000000000]              
	struct FVector                                     HitNormal;                                        		// 0x00D0 (0x000C) [0x0000000000000000]              
	unsigned long                                      bDodging : 1;                                     		// 0x00DC (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bWheelsTouching : 1;                              		// 0x00DC (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bWorldTouching : 1;                               		// 0x00DC (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned char                                      HitType;                                          		// 0x00E0 (0x0001) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.MessageValue
// 0x0020
struct FMessageValue
{
	struct FString                                     StringValue;                                      		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                IntValue;                                         		// 0x000C (0x0004) [0x0000000000000000]              
	class UObject*                                     ObjectValue;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
	struct FName                                       NameValue;                                        		// 0x0014 (0x0008) [0x0000000000000000]              
	int                                                ValueType;                                        		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.MessagePacket
// 0x0010
struct FMessagePacket
{
	class UMessage_TA*                                 Message;                                          		// 0x0000 (0x0004) [0x0000000000000002]              ( CPF_Const )
	TArray< struct FMessageValue >                     Values;                                           		// 0x0004 (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.ClientFrameData
// 0x0028
struct FClientFrameData
{
	struct FVehicleInputs                              VehicleInput;                                     		// 0x0000 (0x0020) [0x0000000000000000]              
	int                                                frame;                                            		// 0x0020 (0x0004) [0x0000000000000000]              
	float                                              TimeStamp;                                        		// 0x0024 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.LoadoutProductData
// 0x001C
struct FLoadoutProductData
{
	int                                                SlotIndex;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                ProductID;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x0008 (0x0008) UNKNOWN PROPERTY: QWordProperty TAGame._Types_TA.LoadoutProductData.InstanceID
	TArray< class UProductAttribute_TA* >              Attributes;                                       		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.ServerSetLoadoutTeam
// 0x001C
struct FServerSetLoadoutTeam
{
	TArray< struct FLoadoutProductData >               Products;                                         		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FLoadoutTeamPaint                           TeamPaint;                                        		// 0x000C (0x0010) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.ServerSetLoadoutParams
// 0x0040
struct FServerSetLoadoutParams
{
	struct FName                                       Title;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FServerSetLoadoutTeam                       Loadouts[ 0x2 ];                                  		// 0x0008 (0x0038) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TAGame._Types_TA.LoadoutTeam
// 0x0014
struct FLoadoutTeam
{
	unsigned char                                      UnknownData00[ 0xC ];                             		// 0x0000 (0x000C) UNKNOWN PROPERTY: ArrayProperty TAGame._Types_TA.LoadoutTeam.Products
	struct FLoadoutTeamColor                           TeamColor;                                        		// 0x000C (0x0008) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.RandomRange
// 0x0008
struct FRandomRange
{
	float                                              Min;                                              		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Max;                                              		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TAGame._Types_TA.SchematicResourceData
// 0x000C
struct FSchematicResourceData
{
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x0000 (0x0008) UNKNOWN PROPERTY: QWordProperty TAGame._Types_TA.SchematicResourceData.InstanceID
	int                                                Resources;                                        		// 0x0008 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
};

// ScriptStruct TAGame._Types_TA.ProductFilter
// 0x008D
struct FProductFilter
{
	TArray< class UOnlineProduct_TA* >                 OnlineProducts;                                   		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UProduct_TA* >                       Products;                                         		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Label;                                            		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      Slots;                                            		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< unsigned char >                            Qualities;                                        		// 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< unsigned char >                            UnlockMethods;                                    		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< unsigned char >                            TradeRestrictions;                                		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UClass* >                            ExclusiveAttributes;                              		// 0x0054 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UClass* >                            ProhibitedAttributes;                             		// 0x0060 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      SeriesIDs;                                        		// 0x006C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                PackID;                                           		// 0x0078 (0x0004) [0x0000000000000000]              
	unsigned long                                      bExcludePacks : 1;                                		// 0x007C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bIgnoreLicensedCars : 1;                          		// 0x007C (0x0004) [0x0000000000000000] [0x00000002] 
	TArray< int >                                      Loadout;                                          		// 0x0080 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      LogLevel;                                         		// 0x008C (0x0001) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.ThumbnailComponent
// 0x0058
struct FThumbnailComponent
{
	class UActorComponent*                             Component;                                        		// 0x0000 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	unsigned char                                      UnknownData00[ 0xC ];                             		// 0x0004 (0x000C) MISSED OFFSET
	struct FMatrix                                     BaseTransform;                                    		// 0x0010 (0x0040) [0x0000000000000000]              
	struct FName                                       Tag;                                              		// 0x0050 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.TurningCircle
// 0x0010
struct FTurningCircle
{
	struct FVector                                     Center;                                           		// 0x0000 (0x000C) [0x0000000000000000]              
	float                                              Radius;                                           		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TAGame._Types_TA.SeasonMatch
// 0x001C
struct FSeasonMatch
{
	int                                                Week;                                             		// 0x0000 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	int                                                Team0;                                            		// 0x0004 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	int                                                Team1;                                            		// 0x0008 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	int                                                Score0;                                           		// 0x000C (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	int                                                Score1;                                           		// 0x0010 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	int                                                Winner;                                           		// 0x0014 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	unsigned long                                      bBye : 1;                                         		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TAGame._Types_TA.SeasonTeam
// 0x0018
struct FSeasonTeam
{
	struct FString                                     Name;                                             		// 0x0000 (0x000C) [0x0000000040400000]              ( CPF_NeedCtorLink | CPF_EditInlineNotify )
	struct FName                                       LogoAsset;                                        		// 0x000C (0x0008) [0x0000000040000000]              ( CPF_EditInlineNotify )
	int                                                EliminationWeek;                                  		// 0x0014 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
};

// ScriptStruct TAGame._Types_TA.SeasonPlayerStat
// 0x0014
struct FSeasonPlayerStat
{
	int                                                PlayerIndex;                                      		// 0x0000 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	struct FString                                     StatName;                                         		// 0x0004 (0x000C) [0x0000000040400000]              ( CPF_NeedCtorLink | CPF_EditInlineNotify )
