/*
#############################################################################################
# RocketLeague (1.0.10897.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TAGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_MaxAirControlSensitivity                           10.f
#define CONST_MaxSteeringSensitivity                             10.f
#define CONST_UnrealUnitsPerMeter                                100
#define CONST_TRADEHOLD_NONE                                     0
#define CONST_TRADEHOLD_ALL                                      -1
#define CONST_TRADEHOLD_P2P                                      -2
#define CONST_MaxFriendKeyLength                                 64
#define CONST_MeshRadius                                         15.0f

// Enum TAGame.CameraState_DirectorMoving_TA.ECameraLoopType
/*enum ECameraLoopType
{
	CLT_StopAtEnd                                      = 0,
	CLT_PingPong                                       = 1,
	CLT_Loop                                           = 2,
	CLT_MAX                                            = 3
};*/

// Enum TAGame.GFxData_MapPrefs_TA.EMapPrefType
/*enum EMapPrefType
{
	MapPrefType_None                                   = 0,
	MapPrefType_Like                                   = 1,
	MapPrefType_Dislike                                = 2,
	MapPrefType_MAX                                    = 3
};*/

// Enum TAGame.GFxData_ProductFilter_TA.EProductFilterType
/*enum EProductFilterType
{
	ProductFilterType_TradeIn                          = 0,
	ProductFilterType_P2P                              = 1,
	ProductFilterType_MAX                              = 2
};*/

// Enum TAGame.SpecialEventConfig_TA.ESpecialEventState
/*enum ESpecialEventState
{
	SES_Inactive                                       = 0,
	SES_Active                                         = 1,
	SES_Redemption                                     = 2,
	SES_MAX                                            = 3
};*/

// Enum TAGame.GFxData_TrainingModeBrowser_TA.ETrainingModeSearchTypes
/*enum ETrainingModeSearchTypes
{
	TMST_AllPublic                                     = 0,
	TMST_FeaturedOnly                                  = 1,
	TMST_MAX                                           = 2
};*/

// Enum TAGame.GFxData_UnlockNotification_TA.EUnlockType
/*enum EUnlockType
{
	UnlockType_AchievementUnlocked                     = 0,
	UnlockType_ChallengeActive                         = 1,
	UnlockType_ChallengeUnlocked                       = 2,
	UnlockType_MAX                                     = 3
};*/

// Enum TAGame.StaticMeshRBActor_TA.EApplyForceTo
/*enum EApplyForceTo
{
	EAF_None                                           = 0,
	EAF_Any                                            = 1,
	EAF_CarOnly                                        = 2,
	EAF_BallOnly                                       = 3,
	EAF_MAX                                            = 4
};*/

// Enum TAGame.TMetricsShared_TA.EFinishType
/*enum EFinishType
{
	EFinishType_Completed                              = 0,
	EFinishType_Quit                                   = 1,
	EFinishType_Error                                  = 2,
	EFinishType_MAX                                    = 3
};*/

// Enum TAGame.TMetricsShared_TA.EMatchType
/*enum EMatchType
{
	EmatchType_Online                                  = 0,
	EMatchType_Private                                 = 1,
	EMatchType_Offline                                 = 2,
	EMatchType_MAX                                     = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class TAGame._AITypes_TA
// 0x0000 (0x003C - 0x003C)
class U_AITypes_TA : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3506 ];

		return pClassPointer;
	};

};

UClass* U_AITypes_TA::pClassPointer = NULL;

// Class TAGame._Types_TA
// 0x0030 (0x006C - 0x003C)
class U_Types_TA : public UObject
{
public:
	struct FScriptDelegate                             __AssetLoadedDelegate__Delegate;                  		// 0x003C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0040 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __ProductThumbnailRenderedDelegate__Delegate;     		// 0x004C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x0050 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __MapImageLoadedDelegate__Delegate;               		// 0x005C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData02[ 0x4 ];                             		// 0x0060 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3508 ];

		return pClassPointer;
	};

	struct FLoadoutTeamPaint GetLoadoutPaint ( struct FLoadoutData InLoadoutData );
	int GetRandomColorID ( class UCarColorSet_TA* Set );
	void InitColorSet ( class UCarColorSet_TA* Set, TArray< struct FGFxTeamColor >* OutColors );
	struct FString ProductQualityToString ( unsigned char Quality );
	bool TeamPaintsAreDifferent ( struct FLoadoutData* A, struct FLoadoutData* B );
	bool OnlineProductsAreDifferent ( );
	bool ProductsAreDifferent ( TArray< int >* A, TArray< int >* B );
	bool LoadoutsAreDifferent ( struct FLoadoutData* A, struct FLoadoutData* B );
	float UpdateInputValue ( struct FInputRate Rate, float DesiredValue, float OldValue, float DeltaTime );
	struct FClientLoadoutData ConvertToClientLoadout ( struct FLoadoutData* FromData );
	void MapImageLoadedDelegate ( struct FMapImageLoadResult Result );
	void ProductThumbnailRenderedDelegate ( struct FProductThumbnailResult Result );
	void AssetLoadedDelegate ( struct FAssetLoadResult Result );
	struct FRandomWeight PickWeightedRandom ( TArray< struct FRandomWeight > Arr, int* Index );
	bool VehicleInputHasChangedForKick ( struct FVehicleInputs* NewInput, struct FVehicleInputs* OldInput );
};

UClass* U_Types_TA::pClassPointer = NULL;

// Class TAGame.AIController_TA
// 0x01C8 (0x0560 - 0x0398)
class AAIController_TA : public AAIController
{
public:
	class ACar_TA*                                     Car;                                              		// 0x0398 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class AVehicle_TA*                                 Vehicle;                                          		// 0x039C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UBTComponent*                                BT;                                               		// 0x03A0 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UBTProxyType*                                SelfProxyType;                                    		// 0x03A4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                NoneProxyType;                                    		// 0x03A8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                DebugProxyType;                                   		// 0x03AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                TeamCarsProxyType;                                		// 0x03B0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                EnemyCarsProxyType;                               		// 0x03B4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                OtherCarsProxyType;                               		// 0x03B8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                BoostPillsProxyType;                              		// 0x03BC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                SelectedProxyType;                                		// 0x03C0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   SelfTarget;                                       		// 0x03C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   NoneTarget;                                       		// 0x03C8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   IteratorTarget;                                   		// 0x03CC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   TeamCarsTarget;                                   		// 0x03D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   SelectedTarget;                                   		// 0x03D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   ContextTarget;                                    		// 0x03D8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UBTNode*                                     DebugBTNode;                                      		// 0x03DC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTLockCollection*                           Locks;                                            		// 0x03E0 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FSkillRange                                 SkillSteerError;                                  		// 0x03E4 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FSkillRange                                 SkillSteerSpeed;                                  		// 0x03F0 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FSkillRange                                 SkillThrottleSpeed;                               		// 0x03FC (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class AGameEvent_TA*                               GameEvent;                                        		// 0x0408 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class AAIManager_TA*                               AIManager;                                        		// 0x040C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FNamedEvent >                       QueuedEvents;                                     		// 0x0410 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FVehicleInputs                              Input;                                            		// 0x041C (0x0020) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     ForwardDir;                                       		// 0x043C (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FRotator                                    ForwardRotation;                                  		// 0x0448 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     GroundNormal;                                     		// 0x0454 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FCachedProxyData >                  CachedProxyDatas;                                 		// 0x0460 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< struct FCachedTargetData >                 CachedTargetDatas;                                		// 0x046C (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FMap_Mirror                                 TargetFilterMap;                                  		// 0x0478 (0x003C) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	TArray< class UBTNode* >                           CachedTargetFilters;                              		// 0x04B4 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FVector                                     DebugDriveDestination;                            		// 0x04C0 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FCachedObstaclesData                        CachedObstacles;                                  		// 0x04CC (0x0024) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	struct FAITraits                                   Traits;                                           		// 0x04F0 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	TArray< class ACar_TA* >                           TeamCars;                                         		// 0x04F8 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< class ACar_TA* >                           EnemyCars;                                        		// 0x0504 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< class ACar_TA* >                           OtherCars;                                        		// 0x0510 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned long                                      bForceUpdateConditions : 1;                       		// 0x051C (0x0004) [0x0000000000002002] [0x00000001] ( CPF_Const | CPF_Transient )
	unsigned long                                      bCanUseBoost : 1;                                 		// 0x051C (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      bBeingReplaced : 1;                               		// 0x051C (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	class UAIRole_TA*                                  TestRole;                                         		// 0x0520 (0x0004) [0x0000000000000000]              
	class UGameShare_TA*                               GameShare;                                        		// 0x0524 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class AActor*                                      SelectedActor;                                    		// 0x0528 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	float                                              FieldScalar;                                      		// 0x052C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FScriptDelegate                             __EventNamedEvent__Delegate;                      		// 0x0530 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0534 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventSkillChanged__Delegate;                    		// 0x0540 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x0544 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventTraitsChanged__Delegate;                   		// 0x0550 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData02[ 0x4 ];                             		// 0x0554 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3510 ];

		return pClassPointer;
	};

	void PrintDebugInfo ( class UDebugDrawer* Drawer );
	void SetSelectedActor ( class AActor* NewActor );
	void AllTargets ( class UBTTarget* Target, struct FBTProxyData* OutData );
	bool GetObstacleInRadius ( struct FVector Destination, float Radius, struct FVector* HitLocation );
	bool GetObstacle ( struct FVector Destination, struct FVector* HitLocation );
	bool eventGetProxyDataInternal ( class UBTProxyType* Type, int Index, struct FBTProxyData* OutData );
	bool GetIndexedProxyData ( class UBTProxyType* Type, int Index, struct FBTProxyData* OutData );
	bool GetProxyData ( class UBTProxyType* Type, struct FBTProxyData* OutData );
	bool GetIndexedTargetData ( class UBTTarget* Target, int Index, struct FBTProxyData* OutData );
	bool GetTargetData ( class UBTTarget* Target, struct FBTProxyData* OutData );
	struct FBTProxyData eventCreateVehicleProxyData ( class AVehicle_TA* InVehicle );
	struct FBTProxyData eventCreateProxyData ( class AActor* A, float Radius );
	float GetDriveTime ( float Distance );
	float GetDriveDistance ( struct FBTProxyData Proxy );
	struct FVector FlattenOffset ( struct FVector Offset, float* Height );
	struct FVector FlattenDestination ( struct FVector Destination );
	struct FBTProxyData FlattenPhysics ( struct FBTProxyData* ProxyData );
	float GetClosestTime2D ( float MaxTime, struct FBTProxyData* A, struct FBTProxyData* B );
	bool WillImpact2D ( struct FBTProxyData* A, struct FBTProxyData* B, float* CollideTime );
	void AdvancePhysics ( float Time, struct FBTProxyData* PhysicsData );
	void PredictPhysics ( float Time, float GroundZ, struct FBTProxyData* PhysicsData );
	void PredictLanding ( float GroundZ, struct FBTProxyData* Data, float* Time );
	struct FVector AdvanceLocation ( float Time, struct FVector* Loc, struct FVector* Vel, struct FVector* Accel );
	void DebugDriveTo ( struct FVector Destination );
	void DoNothing ( );
	void AbortBT ( );
	void eventOnNamedEvent ( struct FName EventName, class AActor* Sender );
	void eventDestroyed ( );
	void OnCarSetup ( class ACar_TA* InCar );
	void SetCar ( );
	void UnPossess ( );
	void Possess ( class APawn* inPawn, unsigned long bVehicleTransition );
	void SetSkill ( float NewSkill );
	void ReInitBT ( );
	void SetTraits ( struct FAITraits InTraits );
	void HandleOtherCarDestroyed ( class APawn_X* InCar );
	void HandleOtherCarDemolished ( class ACar_TA* Victim, struct FDemolishData Data );
	void HandleOtherCarTeamChanged ( class ACar_TA* InCar );
	void HandleCarSpawned ( class AGameEvent_TA* InGameEvent, class ACar_TA* InCar );
	void Init ( class AGameEvent_TA* InGameEvent );
	void eventPreBeginPlay ( );
	void EventTraitsChanged ( class AAIController_TA* AI );
	void EventSkillChanged ( class AAIController_TA* AI );
	void EventNamedEvent ( class AAIController_TA* AI, struct FName EventName, class AActor* Sender );
};

UClass* AAIController_TA::pClassPointer = NULL;

// Class TAGame.AIController_Soccar_TA
// 0x0068 (0x05C8 - 0x0560)
class AAIController_Soccar_TA : public AAIController_TA
{
public:
	class UBTProxyType*                                BallProxyType;                                    		// 0x0560 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                BallLandingProxyType;                             		// 0x0564 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                BallTeamGoalLineProxyType;                        		// 0x0568 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                BallEnemyGoalLineProxyType;                       		// 0x056C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                BallProjectedProxyType;                           		// 0x0570 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                TeamGoalProxyType;                                		// 0x0574 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                EnemyGoalProxyType;                               		// 0x0578 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTProxyType*                                MidFieldProxyType;                                		// 0x057C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   BallTarget;                                       		// 0x0580 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   TeamGoalTarget;                                   		// 0x0584 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBTTarget*                                   EnemyGoalTarget;                                  		// 0x0588 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AGameEvent_Soccar_TA*                        SoccarGame;                                       		// 0x058C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class ABall_TA*                                    Ball;                                             		// 0x0590 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FAICachedGoalInfo                           TeamGoalInfo;                                     		// 0x0594 (0x0010) [0x0000000000082000]              ( CPF_Transient | CPF_Component )
	struct FAICachedGoalInfo                           EnemyGoalInfo;                                    		// 0x05A4 (0x0010) [0x0000000000082000]              ( CPF_Transient | CPF_Component )
	float                                              LastBallHitTime;                                  		// 0x05B4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FScriptDelegate                             __EventBallChanged__Delegate;                     		// 0x05B8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x05BC (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3512 ];

		return pClassPointer;
	};

	bool eventGetProxyDataInternal ( class UBTProxyType* Type, int Index, struct FBTProxyData* OutData );
	void GetGoalProxy ( class UBTProxyType* Type, struct FAICachedGoalInfo GoalInfo, struct FBTProxyData* OutData );
	void GetBallProxy ( struct FBTProxyData* OutData );
	void SetBall ( class ABall_TA* InBall );
	void HandleNewPickup ( class ACar_TA* InCar, class ASpecialPickup_TA* NewPickup );
	void HandleHitBall ( class ACar_TA* InCar, class ABall_TA* HitBall );
	void OnCarSetup ( class ACar_TA* InCar );
	void UpdateBall ( );
	void HandleActiveRoundChanged ( class AGameEvent_Soccar_TA* G );
	void HandleBallsChanged ( class AGameEvent_Soccar_TA* G, class ABall_TA* B );
	struct FAICachedGoalInfo GetCachedGoalInfo ( int TeamNum );
	void Init ( class AGameEvent_TA* InGameEvent );
	void EventBallChanged ( class AAIController_Soccar_TA* SoccarAI );
};

UClass* AAIController_Soccar_TA::pClassPointer = NULL;

// Class TAGame.AIManager_TA
// 0x0028 (0x0224 - 0x01FC)
class AAIManager_TA : public AActor
{
public:
	unsigned long                                      bFlushAILogEachLine : 1;                          		// 0x01FC (0x0004) [0x0000000000004003] [0x00000001] ( CPF_Edit | CPF_Const | CPF_Config )
	unsigned long                                      bOutputLogToWindow : 1;                           		// 0x01FC (0x0004) [0x0000000000004003] [0x00000002] ( CPF_Edit | CPF_Const | CPF_Config )
	unsigned long                                      bPauseForDirtyTrees : 1;                          		// 0x01FC (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	class UBTLockCollection*                           Locks;                                            		// 0x0200 (0x0004) [0x000000000408000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class AGameEvent_TA*                               GameEvent;                                        		// 0x0204 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< class AAIController_TA* >                  Bots;                                             		// 0x0208 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< struct FCachedNavMeshLocation >            CachedNavMeshLocations;                           		// 0x0214 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	class AFileLog*                                    AILogFile;                                        		// 0x0220 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3514 ];

		return pClassPointer;
	};

	void eventDestroyed ( );
	void RemoveBot ( class AAIController_TA* Bot );
	void AddBot ( class AAIController_TA* Bot );
	void Init ( class AGameEvent_TA* InGameEvent );
	void eventAILog ( class UObject* Sender, struct FString Message, unsigned long bVerbose );
};

UClass* AAIManager_TA::pClassPointer = NULL;

// Class TAGame.AnimNodeBlend_TA
// 0x000F (0x0100 - 0x00F1)
class UAnimNodeBlend_TA : public UAnimNodeBlendBase
{
public:
	float                                              BlendSpeed;                                       		// 0x00F4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Position;                                         		// 0x00F8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              DesiredPosition;                                  		// 0x00FC (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3516 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeBlend_TA::pClassPointer = NULL;

// Class TAGame.AnimNodeBlendBoost_TA
// 0x0004 (0x0108 - 0x0104)
class UAnimNodeBlendBoost_TA : public UAnimNodeBlend
{
public:
	float                                              BlendTime;                                        		// 0x0104 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3518 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeBlendBoost_TA::pClassPointer = NULL;

// Class TAGame.AnimNodeBlendSpeed_TA
// 0x0008 (0x0144 - 0x013C)
class UAnimNodeBlendSpeed_TA : public UAnimNodeAimOffset
{
public:
	float                                              BlendRate;                                        		// 0x013C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MaxSpeed;                                         		// 0x0140 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3520 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeBlendSpeed_TA::pClassPointer = NULL;

// Class TAGame.AssetProfiler_TA
// 0x0080 (0x027C - 0x01FC)
class AAssetProfiler_TA : public AActor
{
public:
	float                                              TimePerAsset;                                     		// 0x01FC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              TimeBetweenAssets;                                		// 0x0200 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UProductSlot_TA* >                   Slots;                                            		// 0x0204 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FRenderProfile                              CurrentProfile;                                   		// 0x0210 (0x0024) [0x0000000000002000]              ( CPF_Transient )
	struct FRenderProfile                              NoneAssetProfile;                                 		// 0x0234 (0x0024) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FAssetProfile >                     AssetProfiles;                                    		// 0x0258 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                CurrentProductID;                                 		// 0x0264 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UProductAsset_TA*                            CurrentProduct;                                   		// 0x0268 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UProductDatabase_TA*                         ProductsDB;                                       		// 0x026C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< class ACarPreviewActor_TA* >               Cars;                                             		// 0x0270 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3522 ];

		return pClassPointer;
	};

	void RecordAssetFrameTimesToCSV ( );
	void Finish ( );
	void StopRecording ( );
	void StartRecording ( );
	void StartNextAsset ( );
	void StopRecordingNoneAsset ( );
	void StartRecordingNoneAsset ( );
	void StartProfiling ( );
	void EquipProduct ( class UProductAsset_TA* Asset );
	class UProductAsset_TA* EquipProductID ( int ProductID );
	bool ShouldProfileProduct ( class UProductAsset_TA* Product );
	void PrintAsset ( struct FString AssetName, float AssetTime );
	void UpdateProfileTimes ( struct FRenderProfile* Profile );
	void GatherCars ( );
	void DisableVSync ( );
	void SetupPlayers ( );
	void eventPostBeginPlay ( );
};

UClass* AAssetProfiler_TA::pClassPointer = NULL;

// Class TAGame.AttachmentBehavior_TA
// 0x000C (0x0048 - 0x003C)
class UAttachmentBehavior_TA : public UObject
{
public:
	class UProductAsset_TA*                            Asset;                                            		// 0x003C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UActorComponent*                             Component;                                        		// 0x0040 (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	unsigned long                                      bPreview : 1;                                     		// 0x0044 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3524 ];

		return pClassPointer;
	};

	class UCarMeshComponent_TA* GetMesh ( );
	void SetPreviewing ( unsigned long bPreviewing );
	void OnInit ( );
	void Init ( class UProductAsset_TA* InAsset, class UActorComponent* InComponent );
};

UClass* UAttachmentBehavior_TA::pClassPointer = NULL;

// Class TAGame.RimSpinner_TA
// 0x0030 (0x0078 - 0x0048)
class URimSpinner_TA : public UAttachmentBehavior_TA
{
public:
	float                                              AccelRate;                                        		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DecelRate;                                        		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MaxSpeed;                                         		// 0x0050 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       BoneControlName;                                  		// 0x0054 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              SpinScale;                                        		// 0x005C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                WheelIndex;                                       		// 0x0060 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              CurrentSpeed;                                     		// 0x0064 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                CurrentRotation;                                  		// 0x0068 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class USkelControlSingleBone*                      SpinBoneController;                               		// 0x006C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class USkelControlSingleBone*                      WheelBoneController;                              		// 0x0070 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UWheel_TA*                                   Wheel;                                            		// 0x0074 (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3526 ];

		return pClassPointer;
	};

	void HandleAttached ( class UCarMeshComponent_TA* Mesh );
	void OnInit ( );
};

UClass* URimSpinner_TA::pClassPointer = NULL;

// Class TAGame.PlayerControllerBase_TA
// 0x003C (0x0678 - 0x063C)
class APlayerControllerBase_TA : public APlayerController_X
{
public:
	float                                              SpectatorCameraAccel;                             		// 0x063C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     SpectatorVelXY;                                   		// 0x0640 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	float                                              SpectatorVelZ;                                    		// 0x064C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UPostProcessManager_TA*                      PostProcessManagerArchetype;                      		// 0x0650 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UPostProcessManager_TA*                      PostProcessManager;                               		// 0x0654 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                SpectatorPitchDir;                                		// 0x0658 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                SwivelPitchDir;                                   		// 0x065C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class ASpectatorVolume_TA*                         SpectatorVolume;                                  		// 0x0660 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UPlayerBanner_TA*                            PlayerBanner;                                     		// 0x0664 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FScriptDelegate                             __EventLoadingUnfairMatch__Delegate;              		// 0x0668 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x066C (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3528 ];

		return pClassPointer;
	};

	struct FVector UpdateSpectatorLocation ( struct FVector CurrentLocation, float DeltaTime, unsigned long bAlwaysClamp );
	void PrintDebugInfo ( class UDebugDrawer* Drawer );
	bool FindSpectatorVolumeLocation ( struct FVector CurrentLocation, struct FVector NextLocation, struct FVector* NewLocation );
	struct FVector ClampSpectatorLocation ( struct FVector NewLocation );
	void SetWorldSelectionUpdate ( unsigned long bAllowUpdate );
	void SetWorldSelectionAllowed ( unsigned long bAllowSelection );
	void SetPlayerInput ( class UClass* NewInputClass );
	void StartLanMatch ( struct FCustomMatchSettings* Settings );
	struct FString BuildMatchOptionsLan ( struct FCustomMatchSettings* Settings, TArray< struct FString >* ArrayInitializer_1FED97884D4A55F6D69DCFB86AC2B2B0 );
	void StartSplitscreenMatch ( struct FCustomMatchSettings* Settings, TArray< struct FString >* ArrayInitializer_52CD63F6468524E3BDDE58992F4AD89C );
	void StartMatch ( struct FName PlaylistName, struct FString URL );
	struct FString BuildMatchOptions ( class UGameSettingPlaylist_X* Playlist, TArray< struct FString > Options, struct FCustomMatchSettings* Settings, struct FString* ReduceLocal_4515250C49311C7D280EB09ECA3117E2 );
	struct FString JoinOption ( struct FString FullString, struct FString Value );
	struct FName GetValidMapName ( struct FName InName, int GameMode );
	void ClientRemoveSSPlayer ( struct FString Reason, struct FString Title );
	void OnGameInviteAccepted ( struct FString ErrorString, struct FOnlineGameSearchResult* InviteResult );
	void UpdateSpectatorViewRotation ( float DeltaTime );
	struct FRotator GetSpectatorViewRotationDeltaRotation ( float DeltaTime );
	bool PartyLobbyMessage_TA ( struct FUniqueNetId InSenderId, struct FString PlayerName, struct FString Message, unsigned long bIsLocalPlayer, unsigned char PartyChatCommand );
	void Say_TA ( struct FString Message, unsigned char ChatChannel, struct FUniqueNetId Recipient, unsigned long bPreset );
	void ServerSay_TA ( struct FString Message, unsigned char ChatChannel, unsigned long bPreset );
	void RepopulateChatHistory ( );
	bool InviteHasEnoughSpace ( class UOnlineGameSettings* InviteSettings );
	bool ShouldEnableForceFeedback ( );
	class USaveData_TA* GetSaveData ( );
	class UProfile_TA* GetProfile ( );
	class ULocalPlayer_TA* GetLocalPlayer ( );
	void InitProfileSettings ( unsigned long bJustReceivedPlayer );
	void eventDestroyed ( );
	void eventReceivedPlayer ( );
	void eventPostBeginPlay ( );
	void EventLoadingUnfairMatch ( class APlayerControllerBase_TA* PlayerControllerBase );
};

UClass* APlayerControllerBase_TA::pClassPointer = NULL;

// Class TAGame.PlayerController_TA
// 0x01F8 (0x0870 - 0x0678)
class APlayerController_TA : public APlayerControllerBase_TA
{
public:
	struct FClientData                                 Client;                                           		// 0x0678 (0x002C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FClientStatsData                            ClientStats;                                      		// 0x06A4 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	class ACar_TA*                                     Car;                                              		// 0x06B0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class APRI_TA*                                     PRI;                                              		// 0x06B4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FVehicleInputs                              VehicleInput;                                     		// 0x06B8 (0x0020) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bReceivedServerShutdownMessage : 1;               		// 0x06D8 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bPendingIdleKick : 1;                             		// 0x06D8 (0x0004) [0x0000000000002020] [0x00000002] ( CPF_Net | CPF_Transient )
	unsigned long                                      bUseDebugInputs : 1;                              		// 0x06D8 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bJumpPressed : 1;                                 		// 0x06D8 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bBoostPressed : 1;                                		// 0x06D8 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bHandbrakePressed : 1;                            		// 0x06D8 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bHasPitchedBack : 1;                              		// 0x06D8 (0x0004) [0x0000000000000000] [0x00000040] 
	struct FString                                     LoginURL;                                         		// 0x06DC (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned char                                      VoiceFilter;                                      		// 0x06E8 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	unsigned char                                      ChatFilter;                                       		// 0x06E9 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	struct FChatSpamData                               ChatSpam;                                         		// 0x06EC (0x0018) [0x0000000000000001]              ( CPF_Edit )
	class ULightBarComponent_TA*                       LightBar;                                         		// 0x0704 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UGameMusicComponent_TA*                      MusicComponent;                                   		// 0x0708 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UListenerLocationComponent_TA*               ListenerLocationComponent;                        		// 0x070C (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UAudioPriorityComponent_TA*                  AudioPriorityComponent;                           		// 0x0710 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class APRI_TA*                                     FollowTarget;                                     		// 0x0714 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UOnlineGameTrial_X*                          Trial;                                            		// 0x0718 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class ACamera*                                     SpectatorCameraArchetype;                         		// 0x071C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AHUD*                                        SpectatorHUDArchetype;                            		// 0x0720 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      SpectatorInputClass;                              		// 0x0724 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class ACamera*                                     EditorCameraArchetype;                            		// 0x0728 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AHUD*                                        EditorHUDArchetype;                               		// 0x072C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      EditorInputClass;                                 		// 0x0730 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UInterface_GameEditor_TA*                    MoveActor;                                        		// 0x0734 (0x0008) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0738 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FVector                                     MoveActorGrabOffset;                              		// 0x073C (0x000C) [0x0000000000000000]              
	float                                              MoveActorGrabIncrement;                           		// 0x0748 (0x0004) [0x0000000000000000]              
	float                                              MinMoveActorGrabDistance;                         		// 0x074C (0x0004) [0x0000000000000000]              
	float                                              MouseIncrementSpeed;                              		// 0x0750 (0x0004) [0x0000000000000000]              
	float                                              BallVelocityIncrementAmount;                      		// 0x0754 (0x0004) [0x0000000000000000]              
	int                                                BallVelocityIncrementFireCount;                   		// 0x0758 (0x0004) [0x0000000000000000]              
	float                                              BallVelocityIncrementFireCountMax;                		// 0x075C (0x0004) [0x0000000000000000]              
	float                                              BallVelocityIncrementSpeedDefault;                		// 0x0760 (0x0004) [0x0000000000000000]              
	float                                              BallVelocityIncrementSpeedMax;                    		// 0x0764 (0x0004) [0x0000000000000000]              
	float                                              CrosshairTraceDistance;                           		// 0x0768 (0x0004) [0x0000000000000000]              
	class AActor*                                      TracedCrosshairActor;                             		// 0x076C (0x0004) [0x0000000000000000]              
	TArray< struct FCrosshairExtentInfo >              CrosshairTraceExtents;                            		// 0x0770 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UInterface_GameEditor_TA*                    RotatedActor;                                     		// 0x077C (0x0008) [0x0000000000000000]              
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x0780 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FVector                                     RotateActorCameraLocationOffset;                  		// 0x0784 (0x000C) [0x0000000000000000]              
	struct FVector                                     RotateActorCameraRotationOffset;                  		// 0x0790 (0x000C) [0x0000000000000000]              
	int                                                RotateActorCameraSide;                            		// 0x079C (0x0004) [0x0000000000000000]              
	float                                              DesiredCameraSide;                                		// 0x07A0 (0x0004) [0x0000000000000000]              
	float                                              PawnTypeChangedTime;                              		// 0x07A4 (0x0004) [0x0000000000000000]              
	int                                                SelectedSpawnArchetype;                           		// 0x07A8 (0x0004) [0x0000000000000000]              
	struct FVehicleInputs                              DebugInputs;                                      		// 0x07AC (0x0020) [0x0000000000002000]              ( CPF_Transient )
	float                                              DelayBetweenMovePackets;                          		// 0x07CC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              TimeSinceLastMovePacket;                          		// 0x07D0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UPlatformMetrics_TA*                         PlatformMetrics;                                  		// 0x07D4 (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	float                                              MouseXDeadZone;                                   		// 0x07D8 (0x0004) [0x0000000000000000]              
	float                                              MouseYDeadZone;                                   		// 0x07DC (0x0004) [0x0000000000000000]              
	float                                              MouseXDeadZoneAir;                                		// 0x07E0 (0x0004) [0x0000000000000000]              
	float                                              MouseYDeadZoneAir;                                		// 0x07E4 (0x0004) [0x0000000000000000]              
	struct FVehicleInputs                              LastInputs;                                       		// 0x07E8 (0x0020) [0x0000000000000000]              
	class APRI_TA*                                     PendingViewPRI;                                   		// 0x0808 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UNetworkJitterSettings_TA*                   JitterSettings;                                   		// 0x080C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FScriptDelegate                             __EventLaunchAccountPicker__Delegate;             		// 0x0810 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData02[ 0x4 ];                             		// 0x0814 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventLaunchControllerApplet__Delegate;          		// 0x0820 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData03[ 0x4 ];                             		// 0x0824 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventPendingIdleKickChanged__Delegate;          		// 0x0830 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData04[ 0x4 ];                             		// 0x0834 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventMuteChanged__Delegate;                     		// 0x0840 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData05[ 0x4 ];                             		// 0x0844 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventTrainingEditorActorModified__Delegate;     		// 0x0850 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData06[ 0x4 ];                             		// 0x0854 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventSelectBallCamTarget__Delegate;             		// 0x0860 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData07[ 0x4 ];                             		// 0x0864 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3530 ];

		return pClassPointer;
	};

	void __PlayerController_TA__PostBeginPlay ( class UNetworkJitterSettings_TA* O );
	void ServerUpdateCustomMatchSettings ( struct FCustomMatchSettings Settings );
	void ServerCreateMatchBroadcast ( class AGameEvent_Soccar_TA* GameEvent );
	void ClampMoveActorGrabOffset ( );
	void RevertToDefaultCameraHUDInput ( );
	void SetCameraHUDInput ( class ACamera* InCameraArchetype, class AHUD* InHUDArchetype, class UClass* InPlayerInputClass );
	void SwitchToEditPawn ( );
	void ToggleEditorRound ( );
	void ToggleBetweenCarAndEditPawn ( );
	void Interact ( );
	void StopMovement ( unsigned long bOnlyIfNoAccel );
	struct FVector GetRotateActorCameraOffset ( float DeltaTime, unsigned long bSnap );
	void RestoreEditorPawnOrientation ( );
	void BackupEditorPawnOrientation ( );
	bool EditorPawnDeSerialize ( class UJsonObject* Data );
	struct FString EditorPawnSerialize ( );
	void UpdateRotatedActorOrientation ( float DeltaTime );
	void OnOpenPauseMenu ( );
	void ResetMouseCenter ( );
	float CalculateMouseAxis ( float Center, float CurrentLocation, float Deadzone, float MaxDist );
	struct FVector CalculateMouseAccelInput ( float XDeadZone, float YDeadZone, float XMaxDist, float YMaxDist, struct FVector* CurrentLocation );
	void ShowControllerApplet ( );
	void ShowAccountPicker ( );
	void QueSaveReplay ( );
	void SetFollowTarget ( class APRI_TA* InTarget );
	void FollowPlayer ( class APRI_TA* InPlayer );
	void ClientGroupSkillUpdated ( int Playlist, struct FUniqueNetIdGroup4 Players, struct FTierSkillRating Rating );
	void ClientSkillUpdated ( struct FPlayerSkillRating Rating, int Playlist );
	void GetHearSoundTransform ( struct FVector* OutLocation, struct FRotator* OutRotation );
	void ServerReportPlayer ( unsigned char Reason, struct FUniqueNetId PlayerID, struct FString PlayerName, struct FReportedPlayerInfo* StructInitializer_B66B72474E9BCE36456E77B584EE2077, struct FReportPlayerData* StructInitializer_705830F346121B48EE7AF0B54FAFC5E1, struct FReportPlayerData* StructInitializer_AE900ED545C486033B8CA0A93EC9CB8A );
	void HandleLocalStatEvent ( class APRI_TA* InPRI, class UStatEvent_TA* StatEvent, int Count );
	void OnPendingIdleKickChanged ( );
	void SetPendingIdleKick ( unsigned long bPending );
	void ClientSplitscreenJoinResponse ( struct FUniqueNetId PlayerID, unsigned long bAllow );
	void ServerRequestSplitscreenJoin ( struct FUniqueNetId PlayerID, struct FString PlayerName );
	bool eventPreClientTravel ( struct FString PendingURL, unsigned char TravelType, unsigned long bIsSeamlessTravel );
	void KickTrialPlayer ( );
	void NotifyGoalScored ( int ScoredOnTeam );
	void eventDestroyed ( );
	void SetGameHUDArchetype ( class AHUD* InArchetype );
	bool ShouldBeMuted ( class APlayerController_TA* Other );
	bool IsCommunicationFiltered ( unsigned char Filter, class APlayerController_TA* Other, unsigned long bPreset );
	void RefreshMutedPlayers ( unsigned long bForceRefresh );
	void eventServerUnmutePlayer ( struct FUniqueNetId PlayerNetId );
	void eventServerMutePlayer ( struct FUniqueNetId PlayerNetId );
	void GameplayUnmutePlayer ( struct FUniqueNetId PlayerNetId );
	void GameplayMutePlayer ( struct FUniqueNetId PlayerNetId );
	struct FString GetDebugMutePlayerName ( struct FUniqueNetId PlayerNetId );
	void ServerSetChatFilter ( unsigned char InVoiceFilter );
	void ServerSetVoiceFilter ( unsigned char InVoiceFilter );
	bool IsExplictlyMuted ( struct FUniqueNetId PlayerNetId );
	void HandlePRIUniqueIdChanged ( class APRI_X* InPRI );
	void ReplicateMutedPlayers ( );
	void DebugAI ( );
	void ClientNotifyChatDisabled ( float Time );
	void ChatMessage_TA ( class APlayerReplicationInfo* InPRI, struct FString Message, unsigned char ChatChannel, unsigned long bPreset );
	void ServerSayInternal_TA ( struct FString Message, unsigned char ChatChannel, unsigned long bPreset );
	void ServerSay_TA ( struct FString Message, unsigned char ChatChannel, unsigned long bPreset );
	void Say_TA ( struct FString Message, unsigned char ChatChannel, struct FUniqueNetId Recipient, unsigned long bPreset );
	bool CanChatWith ( class APlayerController_TA* Other, unsigned long bPreset );
	bool AllowTextMessage ( struct FString msg );
	void PushToTalkEnd ( );
	void PushToTalk ( );
	void HandleJoinGameMigrationCompleted ( unsigned long bSuccess, struct FString FailReason );
	void ClientNotifyServerShutdown ( );
	void eventClientUnmutePlayer ( struct FUniqueNetId PlayerNetId );
	void eventClientMutePlayer ( struct FUniqueNetId PlayerNetId, unsigned long bAddToMuteList );
	void GetOnlineStatus ( struct FString* PresenceString, struct FString* GameDataString );
	void ClientSetOnlineStatus ( );
	void HandleGameDataSelected ( int PlaylistId, int MutatorIndex );
	void PrintDebugInfo ( class UDebugDrawer* Drawer );
	class AGameEvent_TA* GetGameEvent ( );
	void ClientArbitratedMatchEnded ( );
	void BannedKick ( );
	void NoReservationKick ( );
	void IdleKick ( );
	void ClientUseItem ( struct FVector UseLocation, struct FRotator UseRotation );
	void ServerTeleportCar ( struct FVector SpawnLocation, struct FRotator NewRotation );
	void eventTeleportCar ( struct FVector SpawnLocation, struct FRotator NewRotation );
	void ReceiveMessage ( struct FMessagePacket Packet );
	void ServerUsePickup ( class ARBActor_TA* Target );
	void UsePickup ( );
	void ToggleHandbrake ( unsigned long bHandbrake );
	void PlayerWantsToLaunchBall ( unsigned long bBoost );
	void ToggleBoost ( unsigned long bBoost );
	void ToggleJump ( unsigned long bJump );
	void TargetSelectLeft ( );
	void TargetSelectRight ( );
	void ReleaseRearCamera ( );
	void PressRearCamera ( );
	void ReleaseSecondaryCamera ( );
	void PressSecondaryCamera ( );
	void ReadyUp ( );
	void SwitchTeam ( );
	void SetDefaultCameraMode ( );
	void ResetCameraMode ( );
	struct FName GetCameraMode ( );
	void SetCameraMode ( struct FName NewCamMode );
	void ProcessMove_TA ( struct FVehicleInputs* NewInput );
	void ZeroMoveInput ( );
	void AddMouseMovementVal ( float PositiveInputVal, float NegativeInputVal, float InputDirVal, unsigned long bUsingMouseForPositiveAxis, unsigned long bUsingMouseForNegativeAxis, float* VehicleInputVal, float* CarAirAccelVal );
	void AddInputVal ( float InputVal, unsigned long bAddInputCondition, float* VehicleInputVal );
	void ModifiedAirRotationByMouseInput ( class UPlayerInput_TA* InputTA, float DeadZoneX, float DeadZoneY );
	bool UpdateMouseGroundSteer ( class UPlayerInput_TA* InputTA, float DeltaTime, float Deadzone, float MaxDist, float BrakingSpeed );
	bool UpdateMouseGroundThrottle ( class UPlayerInput_TA* InputTA, float DeltaTime, float Deadzone, float MaxDist );
	void PlayerMove ( float DeltaTime );
	void IgnoreMoveInput ( unsigned long bNewMoveInput );
	void ClientUpdatePing ( float TimeStamp, int InClientFrame );
	void eventSendClientAdjustment ( );
	TArray< struct FClientFrameData > MergeFrames ( TArray< struct FClientFrameData >* ArrayA, TArray< struct FClientFrameData >* ArrayB );
	void UpdateClientInputBuffer ( );
	void ServerMove_TA ( struct FClientPacketData Packet );
	void ReplicateMovePacket ( );
	void eventPostAsyncTick ( float DeltaTime );
	void PrePhysicsStep ( );
	void ProcessEmptyClientFrame ( );
	void ProcessClientFrame ( );
	bool UpdateLastActiveTime ( struct FVehicleInputs* TestInput );
	void HandleAddBoostComponent ( class UObject* BoostObj );
	void OnPawnChange ( class APawn* OldPawn, class APawn* NewPawn );
	void HandleSetProfile ( class ULocalPlayer_TA* LocalPlayer );
